iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
};

#define PWM_1_0 (*(volatile struct PWM_1_0_tag *) 0x40094000)

struct EMAC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LB:1;
      uint64_t LLB:1;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t MPE:1;
      uint64_t CLRSTAT:1;
      uint64_t INCSTAT:1;
      uint64_t WESTAT:1;
      uint64_t BP:1;
      uint64_t TSTART:1;
      uint64_t THALT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_NCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPD:1;
      uint64_t FD:1;
      uint64_t reservedSpace0:1;
      uint64_t JFRAME:1;
      uint64_t CAF:1;
      uint64_t NBC:1;
      uint64_t MTI:1;
      uint64_t UNI:1;
      uint64_t BIG:1;
      uint64_t reservedSpace1:1;
      uint64_t CLK:2;
      uint64_t RTY:1;
      uint64_t PAE:1;
      uint64_t RBOF:2;
      uint64_t RLCE:1;
      uint64_t DRFCS:1;
      uint64_t EFRHD:1;
      uint64_t IRXFCS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_NCFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MDIO:1;
      uint64_t IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_NSR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UBR:1;
      uint64_t COL:1;
      uint64_t RLES:1;
      uint64_t TGO:1;
      uint64_t BEX:1;
      uint64_t COMP:1;
      uint64_t UND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_TSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_RBQP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_TBQP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNA:1;
      uint64_t REC:1;
      uint64_t OVR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_RSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFD:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUND:1;
      uint64_t RLEX:1;
      uint64_t TXERR:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFRE:1;
      uint64_t PTZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFD:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUND:1;
      uint64_t RLE:1;
      uint64_t TXERR:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFR:1;
      uint64_t PTZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFD:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUND:1;
      uint64_t RLE:1;
      uint64_t TXERR:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFR:1;
      uint64_t PTZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFD:1;
      uint64_t RCOMP:1;
      uint64_t RXUBR:1;
      uint64_t TXUBR:1;
      uint64_t TUND:1;
      uint64_t RLE:1;
      uint64_t TXERR:1;
      uint64_t TCOMP:1;
      uint64_t reservedSpace0:2;
      uint64_t ROVR:1;
      uint64_t HRESP:1;
      uint64_t PFR:1;
      uint64_t PTZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
      uint64_t CODE:2;
      uint64_t REGA:5;
      uint64_t PHYA:5;
      uint64_t RW:2;
      uint64_t SOF:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_MAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTIME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_PTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FROK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_PFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTOK:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_FTO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_SCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_MCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FROK:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_FRO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCSE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_FCSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_ALE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_DTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCOL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_LCOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXCOL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_ECOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TUND:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_TUND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_CSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RRE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_RRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ROVR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_ROV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_RSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_ELE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RJB:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_RJA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_USF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SQER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_STE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RLFM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMAC_RLE;

