iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_TNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_TNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_PTSR;

};

#define DACC_1_0 (*(volatile struct DACC_1_0_tag *) 0x400c8000)

struct MATRIX_1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_5;

  uint8_t res0[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_8;

  uint8_t res1[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0PR:2;
      uint64_t reservedSpace0:2;
      uint64_t M1PR:2;
      uint64_t reservedSpace1:2;
      uint64_t M2PR:2;
      uint64_t reservedSpace2:2;
      uint64_t M3PR:2;
      uint64_t reservedSpace3:2;
      uint64_t M4PR:2;
      uint64_t reservedSpace4:2;
      uint64_t M5PR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_PRAS0;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0PR:2;
      uint64_t reservedSpace0:2;
      uint64_t M1PR:2;
      uint64_t reservedSpace1:2;
      uint64_t M2PR:2;
      uint64_t reservedSpace2:2;
      uint64_t M3PR:2;
      uint64_t reservedSpace3:2;
      uint64_t M4PR:2;
      uint64_t reservedSpace4:2;
      uint64_t M5PR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_PRAS1;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0PR:2;
      uint64_t reservedSpace0:2;
      uint64_t M1PR:2;
      uint64_t reservedSpace1:2;
      uint64_t M2PR:2;
      uint64_t reservedSpace2:2;
      uint64_t M3PR:2;
      uint64_t reservedSpace3:2;
      uint64_t M4PR:2;
      uint64_t reservedSpace4:2;
      uint64_t M5PR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_PRAS2;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0PR:2;
      uint64_t reservedSpace0:2;
      uint64_t M1PR:2;
      uint64_t reservedSpace1:2;
      uint64_t M2PR:2;
      uint64_t reservedSpace2:2;
      uint64_t M3PR:2;
      uint64_t reservedSpace3:2;
      uint64_t M4PR:2;
      uint64_t reservedSpace4:2;
      uint64_t M5PR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_PRAS3;

