iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:11;
      uint64_t reservedSpace0:2;
      uint64_t LENEN:1;
      uint64_t HS:1;
      uint64_t TENBITEN:1;
      uint64_t LEN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_ADDR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_DATA;

  uint8_t res6[7];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DBGSTOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_DBGCTRL;

};

#define SERCOM1_SERCOM_I2CM_0 (*(volatile struct SERCOM1_SERCOM_I2CM_0_tag *) 0x42000800)

struct SERCOM1_SERCOM_I2CS_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t MODE:3;
      uint64_t reservedSpace0:2;
      uint64_t RUNSTDBY:1;
      uint64_t reservedSpace1:8;
      uint64_t PINOUT:1;
      uint64_t reservedSpace2:3;
      uint64_t SDAHOLD:2;
      uint64_t reservedSpace3:1;
      uint64_t SEXTTOEN:1;
      uint64_t SPEED:2;
      uint64_t reservedSpace4:1;
      uint64_t SCLSM:1;
      uint64_t reservedSpace5:2;
      uint64_t LOWTOUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_CTRLA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SMEN:1;
      uint64_t GCMD:1;
      uint64_t AACKEN:1;
      uint64_t reservedSpace1:3;
      uint64_t AMODE:2;
      uint64_t CMD:2;
      uint64_t ACKACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_CTRLB;

  uint8_t res0[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PREC:1;
      uint64_t AMATCH:1;
      uint64_t DRDY:1;
      uint64_t reservedSpace0:4;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_INTENCLR;

  uint8_t res1[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PREC:1;
      uint64_t AMATCH:1;
      uint64_t DRDY:1;
      uint64_t reservedSpace0:4;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_INTENSET;

  uint8_t res2[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PREC:1;
      uint64_t AMATCH:1;
      uint64_t DRDY:1;
      uint64_t reservedSpace0:4;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_INTFLAG;

  uint8_t res3[1];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUSERR:1;
      uint64_t COLL:1;
      uint64_t RXNACK:1;
      uint64_t DIR:1;
      uint64_t SR:1;
      uint64_t reservedSpace0:1;
      uint64_t LOWTOUT:1;
      uint64_t CLKHOLD:1;
      uint64_t reservedSpace1:1;
      uint64_t SEXTTOUT:1;
      uint64_t HS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SERCOM_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_SYNCBUSY;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GENCEN:1;
      uint64_t ADDR:10;
      uint64_t reservedSpace0:4;
      uint64_t TENBITEN:1;
      uint64_t reservedSpace1:1;
      uint64_t ADDRMASK:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_ADDR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_DATA;

};

#define SERCOM1_SERCOM_I2CS_0 (*(volatile struct SERCOM1_SERCOM_I2CS_0_tag *) 0x42000800)

struct SERCOM1_SERCOM_SPI_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t MODE:3;
      uint64_t reservedSpace0:2;
      uint64_t RUNSTDBY:1;
      uint64_t IBON:1;
      uint64_t reservedSpace1:7;
      uint64_t DOPO:2;
      uint64_t reservedSpace2:2;
      uint64_t DIPO:2;
      uint64_t reservedSpace3:2;
      uint64_t FORM:4;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t DORD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_CTRLA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSIZE:3;
      uint64_t reservedSpace0:3;
      uint64_t PLOADEN:1;
      uint64_t reservedSpace1:2;
      uint64_t SSDE:1;
      uint64_t reservedSpace2:3;
      uint64_t MSSEN:1;
      uint64_t AMODE:2;
      uint64_t reservedSpace3:1;
      uint64_t RXEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_CTRLB;

  uint8_t res0[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BAUD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_BAUD;

  uint8_t res1[7];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DRE:1;
      uint64_t TXC:1;
      uint64_t RXC:1;
      uint64_t SSL:1;
      uint64_t reservedSpace0:3;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_INTENCLR;

  uint8_t res2[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DRE:1;
      uint64_t TXC:1;
      uint64_t RXC:1;
      uint64_t SSL:1;
      uint64_t reservedSpace0:3;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_INTENSET;

  uint8_t res3[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DRE:1;
      uint64_t TXC:1;
      uint64_t RXC:1;
      uint64_t SSL:1;
      uint64_t reservedSpace0:3;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_INTFLAG;

  uint8_t res4[1];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t BUFOVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SERCOM_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t CTRLB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_SYNCBUSY;

