iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
  uint32_t MPU_MPU_MAIR1;
};

#define MPU_0 (*(volatile struct MPU_0_tag *) 0xe000ed90)

struct NVIC_1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_ISER_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_ISER_1;

  uint8_t res0[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_ICER_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_ICER_1;

  uint8_t res1[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_ISPR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_ISPR_1;

  uint8_t res2[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_ICPR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_ICPR_1;

  uint8_t res3[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IABR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACTIVE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IABR_1;

  uint8_t res4[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_ITNS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITNS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_ITNS_1;

  uint8_t res5[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:8;
      uint64_t PRI_N1:8;
      uint64_t PRI_N2:8;
      uint64_t PRI_N3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IPR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:8;
      uint64_t PRI_N1:8;
      uint64_t PRI_N2:8;
      uint64_t PRI_N3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IPR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:8;
      uint64_t PRI_N1:8;
      uint64_t PRI_N2:8;
      uint64_t PRI_N3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IPR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:8;
      uint64_t PRI_N1:8;
      uint64_t PRI_N2:8;
      uint64_t PRI_N3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IPR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:8;
      uint64_t PRI_N1:8;
      uint64_t PRI_N2:8;
      uint64_t PRI_N3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IPR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:8;
      uint64_t PRI_N1:8;
      uint64_t PRI_N2:8;
      uint64_t PRI_N3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IPR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:8;
      uint64_t PRI_N1:8;
      uint64_t PRI_N2:8;
      uint64_t PRI_N3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IPR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:8;
      uint64_t PRI_N1:8;
      uint64_t PRI_N2:8;
      uint64_t PRI_N3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IPR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:8;
      uint64_t PRI_N1:8;
      uint64_t PRI_N2:8;
      uint64_t PRI_N3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IPR_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:8;
      uint64_t PRI_N1:8;
      uint64_t PRI_N2:8;
      uint64_t PRI_N3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IPR_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:8;
      uint64_t PRI_N1:8;
      uint64_t PRI_N2:8;
      uint64_t PRI_N3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IPR_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_N0:8;
      uint64_t PRI_N1:8;
      uint64_t PRI_N2:8;
      uint64_t PRI_N3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_NVIC_IPR_11;

};

#define NVIC_1_0 (*(volatile struct NVIC_1_0_tag *) 0xe000e100)

struct SCB_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t Revision:4;
      uint64_t PartNo:12;
      uint64_t Architecture:4;
      uint64_t Variant:4;
      uint64_t Implementer:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_CPUID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VECTACTIVE:9;
      uint64_t reservedSpace0:2;
      uint64_t RETTOBASE:1;
      uint64_t VECTPENDING:9;
      uint64_t reservedSpace1:1;
      uint64_t ISRPENDING:1;
      uint64_t ISRPREEMPT:1;
      uint64_t reservedSpace2:1;
      uint64_t PENDSTCLR:1;
      uint64_t PENDSTSET:1;
      uint64_t PENDSVCLR:1;
      uint64_t PENDSVSET:1;
      uint64_t reservedSpace3:1;
      uint64_t PENDNMICLR:1;
      uint64_t PENDNMISET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_ICSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t TBLOFF:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_VTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t VECTCLRACTIVE:1;
      uint64_t SYSRESETREQ:1;
      uint64_t SYSRESETREQS:1;
      uint64_t reservedSpace1:9;
      uint64_t BFHFNMINS:1;
      uint64_t PRIS:1;
      uint64_t ENDIANNESS:1;
      uint64_t VECTKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_AIRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SLEEPONEXIT:1;
      uint64_t SLEEPDEEP:1;
      uint64_t SLEEPDEEPS:1;
      uint64_t SEVONPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t USERSETMPEND:1;
      uint64_t reservedSpace1:1;
      uint64_t UNALIGN_TRP:1;
      uint64_t DIV_0_TRP:1;
      uint64_t reservedSpace2:3;
      uint64_t BFHFNMIGN:1;
      uint64_t reservedSpace3:1;
      uint64_t STKOFHFNMIGN:1;
      uint64_t reservedSpace4:5;
      uint64_t DC:1;
      uint64_t IC:1;
      uint64_t BP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCB_CCR;

