iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
};

#define ADC_1_1 (*(volatile struct ADC_1_1_tag *) 0x42001c00)

struct CCL_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:4;
      uint64_t RUNSTDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CCL_CTRL;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SEQSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CCL_SEQCTRL_0;

  uint8_t res1[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t reservedSpace1:2;
      uint64_t FILTSEL:2;
      uint64_t reservedSpace2:1;
      uint64_t EDGESEL:1;
      uint64_t INSEL0:4;
      uint64_t INSEL1:4;
      uint64_t INSEL2:4;
      uint64_t INVEI:1;
      uint64_t LUTEI:1;
      uint64_t LUTEO:1;
      uint64_t reservedSpace3:1;
      uint64_t TRUTH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCL_LUTCTRL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t reservedSpace1:2;
      uint64_t FILTSEL:2;
      uint64_t reservedSpace2:1;
      uint64_t EDGESEL:1;
      uint64_t INSEL0:4;
      uint64_t INSEL1:4;
      uint64_t INSEL2:4;
      uint64_t INVEI:1;
      uint64_t LUTEI:1;
      uint64_t LUTEO:1;
      uint64_t reservedSpace3:1;
      uint64_t TRUTH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCL_LUTCTRL_1;

};

#define CCL_1 (*(volatile struct CCL_1_tag *) 0x42002c00)

struct DAC_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:4;
      uint64_t RUNSTDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC_CTRLA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EOEN:1;
      uint64_t IOEN:1;
      uint64_t LEFTADJ:1;
      uint64_t VPD:1;
      uint64_t reservedSpace0:1;
      uint64_t DITHER:1;
      uint64_t REFSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC_CTRLB;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t STARTEI:1;
      uint64_t EMPTYEO:1;
      uint64_t INVEI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC_EVCTRL;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t UNDERRUN:1;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC_INTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t UNDERRUN:1;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC_INTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t UNDERRUN:1;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC_INTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t READY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC_STATUS;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DAC_DATA;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATABUF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DAC_DATABUF;

  uint8_t res2[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t DATA:1;
      uint64_t DATABUF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DAC_SYNCBUSY;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DBGRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DAC_DBGCTRL;

};

#define DAC_1 (*(volatile struct DAC_1_tag *) 0x42002000)

struct DMAC_1_1_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t DMAENABLE:1;
      uint64_t CRCENABLE:1;
      uint64_t reservedSpace0:5;
      uint64_t LVLEN0:1;
      uint64_t LVLEN1:1;
      uint64_t LVLEN2:1;
      uint64_t LVLEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMAC_CTRL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CRCBEATSIZE:2;
      uint64_t CRCPOLY:2;
      uint64_t reservedSpace0:4;
      uint64_t CRCSRC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMAC_CRCCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRCDATAIN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CRCDATAIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRCCHKSUM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CRCCHKSUM;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CRCBUSY:1;
      uint64_t CRCZERO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAC_CRCSTATUS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DBGRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAC_DBGCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WRBQOS:2;
      uint64_t FQOS:2;
      uint64_t DQOS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DMAC_QOSCTRL;

  uint8_t res0[1];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWTRIG0:1;
      uint64_t SWTRIG1:1;
      uint64_t SWTRIG2:1;
      uint64_t SWTRIG3:1;
      uint64_t SWTRIG4:1;
      uint64_t SWTRIG5:1;
      uint64_t SWTRIG6:1;
      uint64_t SWTRIG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_SWTRIGCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LVLPRI0:3;
      uint64_t reservedSpace0:4;
      uint64_t RRLVLEN0:1;
      uint64_t LVLPRI1:3;
      uint64_t reservedSpace1:4;
      uint64_t RRLVLEN1:1;
      uint64_t LVLPRI2:3;
      uint64_t reservedSpace2:4;
      uint64_t RRLVLEN2:1;
      uint64_t LVLPRI3:3;
      uint64_t reservedSpace3:4;
      uint64_t RRLVLEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_PRICTRL0;

