iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
};

#define DSU_EXT_1 (*(volatile struct DSU_EXT_1_tag *) 0x41002100)

struct EIC_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t reservedSpace0:2;
      uint64_t CKSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EIC_CTRLA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NMISENSE:3;
      uint64_t NMIFILTEN:1;
      uint64_t NMIASYNCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EIC_NMICTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EIC_NMIFLAG;

  uint8_t res0[1];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIC_SYNCBUSY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINTEO:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIC_EVCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:8;
      uint64_t reservedSpace0:23;
      uint64_t NSCHK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIC_INTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:8;
      uint64_t reservedSpace0:23;
      uint64_t NSCHK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIC_INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:8;
      uint64_t reservedSpace0:23;
      uint64_t NSCHK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIC_INTFLAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASYNCH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIC_ASYNCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SENSE0:3;
      uint64_t FILTEN0:1;
      uint64_t SENSE1:3;
      uint64_t FILTEN1:1;
      uint64_t SENSE2:3;
      uint64_t FILTEN2:1;
      uint64_t SENSE3:3;
      uint64_t FILTEN3:1;
      uint64_t SENSE4:3;
      uint64_t FILTEN4:1;
      uint64_t SENSE5:3;
      uint64_t FILTEN5:1;
      uint64_t SENSE6:3;
      uint64_t FILTEN6:1;
      uint64_t SENSE7:3;
      uint64_t FILTEN7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIC_CONFIG_0;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEBOUNCEN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIC_DEBOUNCEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRESCALER0:3;
      uint64_t STATES0:1;
      uint64_t reservedSpace0:12;
      uint64_t TICKON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIC_DPRESCALER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINSTATE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIC_PINSTATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:8;
      uint64_t reservedSpace0:23;
      uint64_t NMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIC_NSCHK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:8;
      uint64_t reservedSpace0:23;
      uint64_t NMI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIC_NONSEC;

};

#define EIC_1 (*(volatile struct EIC_1_tag *) 0x40002800)

struct EVSYS_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CTRLA;

  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL0:1;
      uint64_t CHANNEL1:1;
      uint64_t CHANNEL2:1;
      uint64_t CHANNEL3:1;
      uint64_t CHANNEL4:1;
      uint64_t CHANNEL5:1;
      uint64_t CHANNEL6:1;
      uint64_t CHANNEL7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_SWEVT;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRI:2;
      uint64_t reservedSpace0:5;
      uint64_t RREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_PRICTRL;

  uint8_t res1[7];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ID:2;
      uint64_t reservedSpace0:6;
      uint64_t OVR:1;
      uint64_t EVD:1;
      uint64_t reservedSpace1:4;
      uint64_t READY:1;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EVSYS_INTPEND;

  uint8_t res2[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHINT0:1;
      uint64_t CHINT1:1;
      uint64_t CHINT2:1;
      uint64_t CHINT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_INTSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSYCH0:1;
      uint64_t BUSYCH1:1;
      uint64_t BUSYCH2:1;
      uint64_t BUSYCH3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_BUSYCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READYUSR0:1;
      uint64_t READYUSR1:1;
      uint64_t READYUSR2:1;
      uint64_t READYUSR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_READYUSR;

  uint8_t res3[256];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHANNEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_USER_22;

  uint8_t res4[157];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NSCHK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_INTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NSCHK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_INTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NSCHK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_INTFLAG;

  uint8_t res5[1];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL0:1;
      uint64_t CHANNEL1:1;
      uint64_t CHANNEL2:1;
      uint64_t CHANNEL3:1;
      uint64_t CHANNEL4:1;
      uint64_t CHANNEL5:1;
      uint64_t CHANNEL6:1;
      uint64_t CHANNEL7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_NONSECCHAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL0:1;
      uint64_t CHANNEL1:1;
      uint64_t CHANNEL2:1;
      uint64_t CHANNEL3:1;
      uint64_t CHANNEL4:1;
      uint64_t CHANNEL5:1;
      uint64_t CHANNEL6:1;
      uint64_t CHANNEL7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_NSCHKCHAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USER0:1;
      uint64_t USER1:1;
      uint64_t USER2:1;
      uint64_t USER3:1;
      uint64_t USER4:1;
      uint64_t USER5:1;
      uint64_t USER6:1;
      uint64_t USER7:1;
      uint64_t USER8:1;
      uint64_t USER9:1;
      uint64_t USER10:1;
      uint64_t USER11:1;
      uint64_t USER12:1;
      uint64_t USER13:1;
      uint64_t USER14:1;
      uint64_t USER15:1;
      uint64_t USER16:1;
      uint64_t USER17:1;
      uint64_t USER18:1;
      uint64_t USER19:1;
      uint64_t USER20:1;
      uint64_t USER21:1;
      uint64_t USER22:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_NONSECUSER_0;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USER0:1;
      uint64_t USER1:1;
      uint64_t USER2:1;
      uint64_t USER3:1;
      uint64_t USER4:1;
      uint64_t USER5:1;
      uint64_t USER6:1;
      uint64_t USER7:1;
      uint64_t USER8:1;
      uint64_t USER9:1;
      uint64_t USER10:1;
      uint64_t USER11:1;
      uint64_t USER12:1;
      uint64_t USER13:1;
      uint64_t USER14:1;
      uint64_t USER15:1;
      uint64_t USER16:1;
      uint64_t USER17:1;
      uint64_t USER18:1;
      uint64_t USER19:1;
      uint64_t USER20:1;
      uint64_t USER21:1;
      uint64_t USER22:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_NSCHKUSER_0;

