iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
  uint8_t res2[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEN:3;
      uint64_t reservedSpace0:3;
      uint64_t CHEN:1;
      uint64_t WRTLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_PCHCTRL_20;

};

#define GCLK_1 (*(volatile struct GCLK_1_tag *) 0x40001c00)

struct MCLK_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CKSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCLK_CTRLA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CKRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCLK_INTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CKRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCLK_INTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CKRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCLK_INTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CPUDIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCLK_CPUDIV;

  uint8_t res0[11];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HPB0:1;
      uint64_t HPB1:1;
      uint64_t HPB2:1;
      uint64_t DMAC:1;
      uint64_t DSU_bitfield:1;
      uint64_t reservedSpace0:1;
      uint64_t PAC_bitfield:1;
      uint64_t NVMCTRL_bitfield:1;
      uint64_t reservedSpace1:4;
      uint64_t TRAM_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCLK_AHBMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAC_bitfield:1;
      uint64_t PM_bitfield:1;
      uint64_t MCLK_bitfield:1;
      uint64_t RSTC:1;
      uint64_t OSCCTRL_bitfield:1;
      uint64_t OSC32KCTRL_bitfield:1;
      uint64_t SUPC:1;
      uint64_t GCLK_bitfield:1;
      uint64_t WDT:1;
      uint64_t RTC:1;
      uint64_t EIC_bitfield:1;
      uint64_t FREQM_bitfield:1;
      uint64_t PORT:1;
      uint64_t AC_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCLK_APBAMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDAU:1;
      uint64_t DSU_bitfield:1;
      uint64_t NVMCTRL_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCLK_APBBMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVSYS_bitfield:1;
      uint64_t SERCOM0:1;
      uint64_t SERCOM1:1;
      uint64_t SERCOM2:1;
      uint64_t TC0:1;
      uint64_t TC1:1;
      uint64_t TC2:1;
      uint64_t ADC:1;
      uint64_t DAC_bitfield:1;
      uint64_t PTC:1;
      uint64_t TRNG_bitfield:1;
      uint64_t CCL_bitfield:1;
      uint64_t OPAMP_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCLK_APBCMASK;

