iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
};

#define OPAMP_1 (*(volatile struct OPAMP_1_tag *) 0x42003000)

struct OSCCTRL_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t CFDEO:1;
      uint64_t TUNEEI:1;
      uint64_t TUNEINV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSCCTRL_EVCTRL;

  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSCRDY:1;
      uint64_t XOSCFAIL:1;
      uint64_t reservedSpace0:2;
      uint64_t OSC16MRDY:1;
      uint64_t reservedSpace1:3;
      uint64_t DFLLULPRDY:1;
      uint64_t DFLLULPLOCK:1;
      uint64_t DFLLULPNOLOCK:1;
      uint64_t reservedSpace2:5;
      uint64_t DPLLLCKR:1;
      uint64_t DPLLLCKF:1;
      uint64_t DPLLLTO:1;
      uint64_t DPLLLDRTO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCCTRL_INTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSCRDY:1;
      uint64_t XOSCFAIL:1;
      uint64_t reservedSpace0:2;
      uint64_t OSC16MRDY:1;
      uint64_t reservedSpace1:3;
      uint64_t DFLLULPRDY:1;
      uint64_t DFLLULPLOCK:1;
      uint64_t DFLLULPNOLOCK:1;
      uint64_t reservedSpace2:5;
      uint64_t DPLLLCKR:1;
      uint64_t DPLLLCKF:1;
      uint64_t DPLLLTO:1;
      uint64_t DPLLLDRTO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCCTRL_INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSCRDY:1;
      uint64_t XOSCFAIL:1;
      uint64_t reservedSpace0:2;
      uint64_t OSC16MRDY:1;
      uint64_t reservedSpace1:3;
      uint64_t DFLLULPRDY:1;
      uint64_t DFLLULPLOCK:1;
      uint64_t DFLLULPNOLOCK:1;
      uint64_t reservedSpace2:5;
      uint64_t DPLLLCKR:1;
      uint64_t DPLLLCKF:1;
      uint64_t DPLLLTO:1;
      uint64_t DPLLLDRTO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCCTRL_INTFLAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XOSCRDY:1;
      uint64_t XOSCFAIL:1;
      uint64_t XOSCCKSW:1;
      uint64_t reservedSpace0:1;
      uint64_t OSC16MRDY:1;
      uint64_t reservedSpace1:3;
      uint64_t DFLLULPRDY:1;
      uint64_t DFLLULPLOCK:1;
      uint64_t DFLLULPNOLOCK:1;
      uint64_t reservedSpace2:5;
      uint64_t DPLLLCKR:1;
      uint64_t DPLLLCKF:1;
      uint64_t DPLLTO:1;
      uint64_t DPLLLDRTO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCCTRL_STATUS;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t XTALEN:1;
      uint64_t CFDEN:1;
      uint64_t SWBEN:1;
      uint64_t reservedSpace1:1;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
      uint64_t GAIN:3;
      uint64_t AMPGC:1;
      uint64_t STARTUP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OSCCTRL_XOSCCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CFDPRESC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSCCTRL_CFDPRESC;

  uint8_t res1[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t FSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSCCTRL_OSC16MCTRL;

  uint8_t res2[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t reservedSpace1:1;
      uint64_t BINSE:1;
      uint64_t SAFE:1;
      uint64_t DITHER:1;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
      uint64_t DIV:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) OSCCTRL_DFLLULPCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t STEP:3;
      uint64_t reservedSpace0:1;
      uint64_t PER:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSCCTRL_DFLLULPDITHER;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t RREQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSCCTRL_DFLLULPRREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCCTRL_DFLLULPDLY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RATIO:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCCTRL_DFLLULPRATIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t TUNE:1;
      uint64_t DELAY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCCTRL_DFLLULPSYNCBUSY;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t reservedSpace1:4;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSCCTRL_DPLLCTRLA;

  uint8_t res3[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDR:12;
      uint64_t reservedSpace0:4;
      uint64_t LDRFRAC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCCTRL_DPLLRATIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FILTER:2;
      uint64_t LPEN:1;
      uint64_t WUF:1;
      uint64_t REFCLK:2;
      uint64_t reservedSpace0:2;
      uint64_t LTIME:3;
      uint64_t reservedSpace1:1;
      uint64_t LBYPASS:1;
      uint64_t reservedSpace2:3;
      uint64_t DIV:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCCTRL_DPLLCTRLB;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRESC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSCCTRL_DPLLPRESC;

  uint8_t res4[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t DPLLRATIO:1;
      uint64_t DPLLPRESC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSCCTRL_DPLLSYNCBUSY;

  uint8_t res5[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t LOCK:1;
      uint64_t CLKRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) OSCCTRL_DPLLSTATUS;

