iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
};

#define PORT_PORT_GROUP_0_1 (*(volatile struct PORT_PORT_GROUP_0_1_tag *) 0x40003000)

struct PORT_IOBUS_PORT_GROUP_0_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_DIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_DIRCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_DIRSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIRTGL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_DIRTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_OUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_OUTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_OUTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTTGL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_OUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_IN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAMPLING:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PINMASK:16;
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
      uint64_t reservedSpace1:1;
      uint64_t PMUX:4;
      uint64_t WRPMUX:1;
      uint64_t reservedSpace2:1;
      uint64_t WRPINCFG:1;
      uint64_t HWSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_WRCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID0:5;
      uint64_t EVACT0:2;
      uint64_t PORTEI0:1;
      uint64_t PID1:5;
      uint64_t EVACT1:2;
      uint64_t PORTEI1:1;
      uint64_t PID2:5;
      uint64_t EVACT2:2;
      uint64_t PORTEI2:1;
      uint64_t PID3:5;
      uint64_t EVACT3:2;
      uint64_t PORTEI3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_EVCTRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXE:4;
      uint64_t PMUXO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PMUX_15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PMUXEN:1;
      uint64_t INEN:1;
      uint64_t PULLEN:1;
      uint64_t reservedSpace0:3;
      uint64_t DRVSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PORT_PINCFG_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSCHK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_INTENCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSCHK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_INTENSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSCHK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_INTFLAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NONSEC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_NONSEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NSCHK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_NSCHK;

