iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
};

#define TRAM_1 (*(volatile struct TRAM_1_tag *) 0x42003400)

struct WDT_1_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t WEN:1;
      uint64_t reservedSpace1:3;
      uint64_t RUNSTDBY:1;
      uint64_t ALWAYSON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WDT_CTRLA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PER:4;
      uint64_t WINDOW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WDT_CONFIG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EWOFFSET:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WDT_EWCTRL;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WDT_INTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WDT_INTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WDT_INTFLAG;

  uint8_t res1[1];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ENABLE:1;
      uint64_t WEN:1;
      uint64_t RUNSTDBY:1;
      uint64_t ALWAYSON:1;
      uint64_t CLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT_SYNCBUSY;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLEAR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WDT_CLEAR;

};

#define WDT_1_1 (*(volatile struct WDT_1_1_tag *) 0x40002000)

struct CoreDebug_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t C_DEBUGEN:1;
      uint64_t C_HALT:1;
      uint64_t C_STEP:1;
      uint64_t C_MASKINTS:1;
      uint64_t reservedSpace0:1;
      uint64_t S_SNAPSTALL:1;
      uint64_t reservedSpace1:10;
      uint64_t S_REGRDY:1;
      uint64_t S_HALT:1;
      uint64_t S_SLEEP:1;
      uint64_t S_LOCKUP:1;
      uint64_t S_SDE:1;
      uint64_t reservedSpace2:3;
      uint64_t S_RETIRE_ST:1;
      uint64_t S_RESET_ST:1;
      uint64_t S_RESTART_ST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CoreDebug_DHCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGSEL:7;
      uint64_t reservedSpace0:9;
      uint64_t REGWnR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CoreDebug_DCRSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VC_CORERESET:1;
      uint64_t reservedSpace0:3;
      uint64_t VC_MMERR:1;
      uint64_t VC_NOCPERR:1;
      uint64_t VC_CHKERR:1;
      uint64_t VC_STATERR:1;
      uint64_t VC_BUSERR:1;
      uint64_t VC_INTERR:1;
      uint64_t VC_HARDERR:1;
      uint64_t VC_SFERR:1;
      uint64_t reservedSpace1:4;
      uint64_t MON_EN:1;
      uint64_t MON_PEND:1;
      uint64_t MON_STEP:1;
      uint64_t MON_REQ:1;
      uint64_t SDME:1;
      uint64_t reservedSpace2:3;
      uint64_t TRCENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CoreDebug_DEMCR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBRSELEN:1;
      uint64_t SBRSEL:1;
      uint64_t reservedSpace0:14;
      uint64_t CDS:1;
      uint64_t CDSKEY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CoreDebug_DSCSR;

};

#define CoreDebug_1 (*(volatile struct CoreDebug_1_tag *) 0xe000edf0)

struct DIB_1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DLAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLI:1;
      uint64_t SLK:1;
      uint64_t nTT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DLSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SID:2;
      uint64_t SNID:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DAUTHSTATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARCHPART:12;
      uint64_t ARCHVER:4;
      uint64_t REVISION:4;
      uint64_t PRESENT:1;
      uint64_t ARCHITECT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DDEVARCH;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAJOR:4;
      uint64_t SUB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DDEVTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_2:4;
      uint64_t SIZE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DPIDR4;

  uint32_t DIB_DPIDR5;
  uint32_t DIB_DPIDR6;
  uint32_t DIB_DPIDR7;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PART_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DPIDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PART_1:4;
      uint64_t DES_0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DPIDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_1:3;
      uint64_t JEDEC:1;
      uint64_t REVISION:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DPIDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMOD:4;
      uint64_t REVAND:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DPIDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRMBL_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DCIDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRMBL_1:4;
      uint64_t CLASS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DCIDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRMBL_2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DCIDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRMBL_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIB_DCIDR3;

