iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
};

#define GMAC_0 (*(volatile struct GMAC_0_tag *) 0x40034000)

struct SMC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t NWE_SETUP:6;
      uint64_t reservedSpace0:2;
      uint64_t NCS_WR_SETUP:6;
      uint64_t reservedSpace1:2;
      uint64_t NRD_SETUP:6;
      uint64_t reservedSpace2:2;
      uint64_t NCS_RD_SETUP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_SETUP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NWE_PULSE:7;
      uint64_t reservedSpace0:1;
      uint64_t NCS_WR_PULSE:7;
      uint64_t reservedSpace1:1;
      uint64_t NRD_PULSE:7;
      uint64_t reservedSpace2:1;
      uint64_t NCS_RD_PULSE:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_PULSE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NWE_CYCLE:9;
      uint64_t reservedSpace0:7;
      uint64_t NRD_CYCLE:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_CYCLE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_MODE:1;
      uint64_t WRITE_MODE:1;
      uint64_t reservedSpace0:2;
      uint64_t EXNW_MODE:2;
      uint64_t reservedSpace1:10;
      uint64_t TDF_CYCLES:4;
      uint64_t TDF_MODE:1;
      uint64_t reservedSpace2:3;
      uint64_t PMEN:1;
      uint64_t reservedSpace3:3;
      uint64_t PS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_MODE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NWE_SETUP:6;
      uint64_t reservedSpace0:2;
      uint64_t NCS_WR_SETUP:6;
      uint64_t reservedSpace1:2;
      uint64_t NRD_SETUP:6;
      uint64_t reservedSpace2:2;
      uint64_t NCS_RD_SETUP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_SETUP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NWE_PULSE:7;
      uint64_t reservedSpace0:1;
      uint64_t NCS_WR_PULSE:7;
      uint64_t reservedSpace1:1;
      uint64_t NRD_PULSE:7;
      uint64_t reservedSpace2:1;
      uint64_t NCS_RD_PULSE:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_PULSE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NWE_CYCLE:9;
      uint64_t reservedSpace0:7;
      uint64_t NRD_CYCLE:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_CYCLE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_MODE:1;
      uint64_t WRITE_MODE:1;
      uint64_t reservedSpace0:2;
      uint64_t EXNW_MODE:2;
      uint64_t reservedSpace1:10;
      uint64_t TDF_CYCLES:4;
      uint64_t TDF_MODE:1;
      uint64_t reservedSpace2:3;
      uint64_t PMEN:1;
      uint64_t reservedSpace3:3;
      uint64_t PS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_MODE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NWE_SETUP:6;
      uint64_t reservedSpace0:2;
      uint64_t NCS_WR_SETUP:6;
      uint64_t reservedSpace1:2;
      uint64_t NRD_SETUP:6;
      uint64_t reservedSpace2:2;
      uint64_t NCS_RD_SETUP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_SETUP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NWE_PULSE:7;
      uint64_t reservedSpace0:1;
      uint64_t NCS_WR_PULSE:7;
      uint64_t reservedSpace1:1;
      uint64_t NRD_PULSE:7;
      uint64_t reservedSpace2:1;
      uint64_t NCS_RD_PULSE:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_PULSE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NWE_CYCLE:9;
      uint64_t reservedSpace0:7;
      uint64_t NRD_CYCLE:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_CYCLE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_MODE:1;
      uint64_t WRITE_MODE:1;
      uint64_t reservedSpace0:2;
      uint64_t EXNW_MODE:2;
      uint64_t reservedSpace1:10;
      uint64_t TDF_CYCLES:4;
      uint64_t TDF_MODE:1;
      uint64_t reservedSpace2:3;
      uint64_t PMEN:1;
      uint64_t reservedSpace3:3;
      uint64_t PS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_MODE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NWE_SETUP:6;
      uint64_t reservedSpace0:2;
      uint64_t NCS_WR_SETUP:6;
      uint64_t reservedSpace1:2;
      uint64_t NRD_SETUP:6;
      uint64_t reservedSpace2:2;
      uint64_t NCS_RD_SETUP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_SETUP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NWE_PULSE:7;
      uint64_t reservedSpace0:1;
      uint64_t NCS_WR_PULSE:7;
      uint64_t reservedSpace1:1;
      uint64_t NRD_PULSE:7;
      uint64_t reservedSpace2:1;
      uint64_t NCS_RD_PULSE:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_PULSE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NWE_CYCLE:9;
      uint64_t reservedSpace0:7;
      uint64_t NRD_CYCLE:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_CYCLE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_MODE:1;
      uint64_t WRITE_MODE:1;
      uint64_t reservedSpace0:2;
      uint64_t EXNW_MODE:2;
      uint64_t reservedSpace1:10;
      uint64_t TDF_CYCLES:4;
      uint64_t TDF_MODE:1;
      uint64_t reservedSpace2:3;
      uint64_t PMEN:1;
      uint64_t reservedSpace3:3;
      uint64_t PS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_MODE3;

  uint8_t res0[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMSE:1;
      uint64_t reservedSpace0:15;
      uint64_t CS0SE:1;
      uint64_t CS1SE:1;
      uint64_t CS2SE:1;
      uint64_t CS3SE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_OCMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_KEY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_KEY2;

  uint8_t res1[88];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMC_WPSR;

