iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFF0:1;
      uint64_t OFF1:1;
      uint64_t OFF2:1;
      uint64_t OFF3:1;
      uint64_t OFF4:1;
      uint64_t OFF5:1;
      uint64_t OFF6:1;
      uint64_t OFF7:1;
      uint64_t OFF8:1;
      uint64_t OFF9:1;
      uint64_t OFF10:1;
      uint64_t OFF11:1;
      uint64_t OFF12:1;
      uint64_t OFF13:1;
      uint64_t OFF14:1;
      uint64_t OFF15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_CDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIFF0:1;
      uint64_t DIFF1:1;
      uint64_t DIFF2:1;
      uint64_t DIFF3:1;
      uint64_t DIFF4:1;
      uint64_t DIFF5:1;
      uint64_t DIFF6:1;
      uint64_t DIFF7:1;
      uint64_t DIFF8:1;
      uint64_t DIFF9:1;
      uint64_t DIFF10:1;
      uint64_t DIFF11:1;
      uint64_t DIFF12:1;
      uint64_t DIFF13:1;
      uint64_t DIFF14:1;
      uint64_t DIFF15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_DIFFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_CSELR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_CDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_COCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTCT:1;
      uint64_t reservedSpace0:3;
      uint64_t TEMPCMPMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_TEMPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLOWTHRES:16;
      uint64_t THIGHTHRES:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_TEMPCWR;

  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t IBCTL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_ACR;

  uint8_t res3[56];

  uint32_t AFEC0_COSR;
  uint32_t AFEC0_CVR;
  uint32_t AFEC0_CECR;
  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_WPSR;

  uint8_t res5[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_RCR;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_RNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_RNCR;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC0_PTSR;

};

#define AFEC0_0 (*(volatile struct AFEC0_0_tag *) 0x400b0000)

struct AFEC1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t START:1;
      uint64_t reservedSpace0:1;
      uint64_t AUTOCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGEN:1;
      uint64_t TRGSEL:3;
      uint64_t reservedSpace0:1;
      uint64_t SLEEP:1;
      uint64_t FWUP:1;
      uint64_t FREERUN:1;
      uint64_t PRESCAL:8;
      uint64_t STARTUP:4;
      uint64_t SETTLING:2;
      uint64_t reservedSpace1:1;
      uint64_t ANACH:1;
      uint64_t TRACKTIM:4;
      uint64_t TRANSFER:2;
      uint64_t reservedSpace2:1;
      uint64_t USEQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMPMODE:2;
      uint64_t reservedSpace0:1;
      uint64_t CMPSEL:5;
      uint64_t reservedSpace1:1;
      uint64_t CMPALL:1;
      uint64_t reservedSpace2:2;
      uint64_t CMPFILTER:2;
      uint64_t reservedSpace3:2;
      uint64_t RES:3;
      uint64_t reservedSpace4:1;
      uint64_t AFEMODE:2;
      uint64_t reservedSpace5:2;
      uint64_t TAG:1;
      uint64_t STM:1;
      uint64_t reservedSpace6:2;
      uint64_t SIGNMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_EMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USCH0:4;
      uint64_t USCH1:4;
      uint64_t USCH2:4;
      uint64_t USCH3:4;
      uint64_t USCH4:4;
      uint64_t USCH5:4;
      uint64_t USCH6:4;
      uint64_t USCH7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_SEQ1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USCH8:4;
      uint64_t USCH9:4;
      uint64_t USCH10:4;
      uint64_t USCH11:4;
      uint64_t USCH12:4;
      uint64_t USCH13:4;
      uint64_t USCH14:4;
      uint64_t USCH15:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_SEQ2R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t CH8:1;
      uint64_t CH9:1;
      uint64_t CH10:1;
      uint64_t CH11:1;
      uint64_t CH12:1;
      uint64_t CH13:1;
      uint64_t CH14:1;
      uint64_t CH15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_CHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t CH8:1;
      uint64_t CH9:1;
      uint64_t CH10:1;
      uint64_t CH11:1;
      uint64_t CH12:1;
      uint64_t CH13:1;
      uint64_t CH14:1;
      uint64_t CH15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_CHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
      uint64_t CH2:1;
      uint64_t CH3:1;
      uint64_t CH4:1;
      uint64_t CH5:1;
      uint64_t CH6:1;
      uint64_t CH7:1;
      uint64_t CH8:1;
      uint64_t CH9:1;
      uint64_t CH10:1;
      uint64_t CH11:1;
      uint64_t CH12:1;
      uint64_t CH13:1;
      uint64_t CH14:1;
      uint64_t CH15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_CHSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LDATA:16;
      uint64_t reservedSpace0:8;
      uint64_t CHNB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_LCDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC0:1;
      uint64_t EOC1:1;
      uint64_t EOC2:1;
      uint64_t EOC3:1;
      uint64_t EOC4:1;
      uint64_t EOC5:1;
      uint64_t EOC6:1;
      uint64_t EOC7:1;
      uint64_t EOC8:1;
      uint64_t EOC9:1;
      uint64_t EOC10:1;
      uint64_t EOC11:1;
      uint64_t EOC12:1;
      uint64_t EOC13:1;
      uint64_t EOC14:1;
      uint64_t EOC15:1;
      uint64_t reservedSpace0:8;
      uint64_t DRDY:1;
      uint64_t GOVRE:1;
      uint64_t COMPE:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
      uint64_t reservedSpace1:1;
      uint64_t TEMPCHG:1;
      uint64_t EOCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC0:1;
      uint64_t EOC1:1;
      uint64_t EOC2:1;
      uint64_t EOC3:1;
      uint64_t EOC4:1;
      uint64_t EOC5:1;
      uint64_t EOC6:1;
      uint64_t EOC7:1;
      uint64_t EOC8:1;
      uint64_t EOC9:1;
      uint64_t EOC10:1;
      uint64_t EOC11:1;
      uint64_t EOC12:1;
      uint64_t EOC13:1;
      uint64_t EOC14:1;
      uint64_t EOC15:1;
      uint64_t reservedSpace0:8;
      uint64_t DRDY:1;
      uint64_t GOVRE:1;
      uint64_t COMPE:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
      uint64_t reservedSpace1:1;
      uint64_t TEMPCHG:1;
      uint64_t EOCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC0:1;
      uint64_t EOC1:1;
      uint64_t EOC2:1;
      uint64_t EOC3:1;
      uint64_t EOC4:1;
      uint64_t EOC5:1;
      uint64_t EOC6:1;
      uint64_t EOC7:1;
      uint64_t EOC8:1;
      uint64_t EOC9:1;
      uint64_t EOC10:1;
      uint64_t EOC11:1;
      uint64_t EOC12:1;
      uint64_t EOC13:1;
      uint64_t EOC14:1;
      uint64_t EOC15:1;
      uint64_t reservedSpace0:8;
      uint64_t DRDY:1;
      uint64_t GOVRE:1;
      uint64_t COMPE:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
      uint64_t reservedSpace1:1;
      uint64_t TEMPCHG:1;
      uint64_t EOCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EOC0:1;
      uint64_t EOC1:1;
      uint64_t EOC2:1;
      uint64_t EOC3:1;
      uint64_t EOC4:1;
      uint64_t EOC5:1;
      uint64_t EOC6:1;
      uint64_t EOC7:1;
      uint64_t EOC8:1;
      uint64_t EOC9:1;
      uint64_t EOC10:1;
      uint64_t EOC11:1;
      uint64_t EOC12:1;
      uint64_t EOC13:1;
      uint64_t EOC14:1;
      uint64_t EOC15:1;
      uint64_t reservedSpace0:8;
      uint64_t DRDY:1;
      uint64_t GOVRE:1;
      uint64_t COMPE:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
      uint64_t reservedSpace1:1;
      uint64_t TEMPCHG:1;
      uint64_t EOCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_ISR;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVRE0:1;
      uint64_t OVRE1:1;
      uint64_t OVRE2:1;
      uint64_t OVRE3:1;
      uint64_t OVRE4:1;
      uint64_t OVRE5:1;
      uint64_t OVRE6:1;
      uint64_t OVRE7:1;
      uint64_t OVRE8:1;
      uint64_t OVRE9:1;
      uint64_t OVRE10:1;
      uint64_t OVRE11:1;
      uint64_t OVRE12:1;
      uint64_t OVRE13:1;
      uint64_t OVRE14:1;
      uint64_t OVRE15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_OVER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOWTHRES:16;
      uint64_t HIGHTHRES:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_CWR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN0:2;
      uint64_t GAIN1:2;
      uint64_t GAIN2:2;
      uint64_t GAIN3:2;
      uint64_t GAIN4:2;
      uint64_t GAIN5:2;
      uint64_t GAIN6:2;
      uint64_t GAIN7:2;
      uint64_t GAIN8:2;
      uint64_t GAIN9:2;
      uint64_t GAIN10:2;
      uint64_t GAIN11:2;
      uint64_t GAIN12:2;
      uint64_t GAIN13:2;
      uint64_t GAIN14:2;
      uint64_t GAIN15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_CGR;

