iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFF0:1;
      uint64_t OFF1:1;
      uint64_t OFF2:1;
      uint64_t OFF3:1;
      uint64_t OFF4:1;
      uint64_t OFF5:1;
      uint64_t OFF6:1;
      uint64_t OFF7:1;
      uint64_t OFF8:1;
      uint64_t OFF9:1;
      uint64_t OFF10:1;
      uint64_t OFF11:1;
      uint64_t OFF12:1;
      uint64_t OFF13:1;
      uint64_t OFF14:1;
      uint64_t OFF15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_CDOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIFF0:1;
      uint64_t DIFF1:1;
      uint64_t DIFF2:1;
      uint64_t DIFF3:1;
      uint64_t DIFF4:1;
      uint64_t DIFF5:1;
      uint64_t DIFF6:1;
      uint64_t DIFF7:1;
      uint64_t DIFF8:1;
      uint64_t DIFF9:1;
      uint64_t DIFF10:1;
      uint64_t DIFF11:1;
      uint64_t DIFF12:1;
      uint64_t DIFF13:1;
      uint64_t DIFF14:1;
      uint64_t DIFF15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_DIFFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_CSELR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_CDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AOFF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_COCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTCT:1;
      uint64_t reservedSpace0:3;
      uint64_t TEMPCMPMOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_TEMPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TLOWTHRES:16;
      uint64_t THIGHTHRES:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_TEMPCWR;

  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t IBCTL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_ACR;

  uint8_t res3[56];

  uint32_t AFEC1_COSR;
  uint32_t AFEC1_CVR;
  uint32_t AFEC1_CECR;
  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_WPSR;

  uint8_t res5[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_RCR;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_RNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_RNCR;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AFEC1_PTSR;

};

#define AFEC1_0 (*(volatile struct AFEC1_0_tag *) 0x400b4000)

struct DACC_1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGEN:1;
      uint64_t TRGSEL:3;
      uint64_t WORD:1;
      uint64_t SLEEP:1;
      uint64_t FASTWKUP:1;
      uint64_t reservedSpace0:1;
      uint64_t REFRESH:8;
      uint64_t USER_SEL:2;
      uint64_t reservedSpace1:2;
      uint64_t TAG:1;
      uint64_t MAXS:1;
      uint64_t CLKDIV:1;
      uint64_t reservedSpace2:1;
      uint64_t STARTUP:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_MR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_CHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_CHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t CH1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_CHSR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_CDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t EOC:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t EOC:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t EOC:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t EOC:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_ISR;

  uint8_t res2[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IBCTLCH0:2;
      uint64_t IBCTLCH1:2;
      uint64_t reservedSpace0:4;
      uint64_t IBCTLDACCORE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_ACR;

  uint8_t res3[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_WPSR;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_TPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_TCR;

