iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_SADDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_DADDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DSCR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_DSCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTSIZE:16;
      uint64_t reservedSpace0:8;
      uint64_t SRC_WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t DST_WIDTH:2;
      uint64_t reservedSpace2:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CTRLA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t SRC_DSCR:1;
      uint64_t reservedSpace1:3;
      uint64_t DST_DSCR:1;
      uint64_t FC:2;
      uint64_t reservedSpace2:1;
      uint64_t SRC_INCR:2;
      uint64_t reservedSpace3:2;
      uint64_t DST_INCR:2;
      uint64_t IEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CTRLB0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_PER:4;
      uint64_t DST_PER:4;
      uint64_t reservedSpace0:1;
      uint64_t SRC_H2SEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DST_H2SEL:1;
      uint64_t reservedSpace2:2;
      uint64_t SOD:1;
      uint64_t reservedSpace3:3;
      uint64_t LOCK_IF:1;
      uint64_t LOCK_B:1;
      uint64_t LOCK_IF_L:1;
      uint64_t reservedSpace4:1;
      uint64_t AHB_PROT:3;
      uint64_t reservedSpace5:1;
      uint64_t FIFOCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CFG0;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_SADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_DADDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DSCR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_DSCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTSIZE:16;
      uint64_t reservedSpace0:8;
      uint64_t SRC_WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t DST_WIDTH:2;
      uint64_t reservedSpace2:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CTRLA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t SRC_DSCR:1;
      uint64_t reservedSpace1:3;
      uint64_t DST_DSCR:1;
      uint64_t FC:2;
      uint64_t reservedSpace2:1;
      uint64_t SRC_INCR:2;
      uint64_t reservedSpace3:2;
      uint64_t DST_INCR:2;
      uint64_t IEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CTRLB1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_PER:4;
      uint64_t DST_PER:4;
      uint64_t reservedSpace0:1;
      uint64_t SRC_H2SEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DST_H2SEL:1;
      uint64_t reservedSpace2:2;
      uint64_t SOD:1;
      uint64_t reservedSpace3:3;
      uint64_t LOCK_IF:1;
      uint64_t LOCK_B:1;
      uint64_t LOCK_IF_L:1;
      uint64_t reservedSpace4:1;
      uint64_t AHB_PROT:3;
      uint64_t reservedSpace5:1;
      uint64_t FIFOCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CFG1;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_SADDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_DADDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DSCR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_DSCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTSIZE:16;
      uint64_t reservedSpace0:8;
      uint64_t SRC_WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t DST_WIDTH:2;
      uint64_t reservedSpace2:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CTRLA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t SRC_DSCR:1;
      uint64_t reservedSpace1:3;
      uint64_t DST_DSCR:1;
      uint64_t FC:2;
      uint64_t reservedSpace2:1;
      uint64_t SRC_INCR:2;
      uint64_t reservedSpace3:2;
      uint64_t DST_INCR:2;
      uint64_t IEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CTRLB2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_PER:4;
      uint64_t DST_PER:4;
      uint64_t reservedSpace0:1;
      uint64_t SRC_H2SEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DST_H2SEL:1;
      uint64_t reservedSpace2:2;
      uint64_t SOD:1;
      uint64_t reservedSpace3:3;
      uint64_t LOCK_IF:1;
      uint64_t LOCK_B:1;
      uint64_t LOCK_IF_L:1;
      uint64_t reservedSpace4:1;
      uint64_t AHB_PROT:3;
      uint64_t reservedSpace5:1;
      uint64_t FIFOCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CFG2;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_SADDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_DADDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t DSCR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_DSCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTSIZE:16;
      uint64_t reservedSpace0:8;
      uint64_t SRC_WIDTH:2;
      uint64_t reservedSpace1:2;
      uint64_t DST_WIDTH:2;
      uint64_t reservedSpace2:1;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CTRLA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t SRC_DSCR:1;
      uint64_t reservedSpace1:3;
      uint64_t DST_DSCR:1;
      uint64_t FC:2;
      uint64_t reservedSpace2:1;
      uint64_t SRC_INCR:2;
      uint64_t reservedSpace3:2;
      uint64_t DST_INCR:2;
      uint64_t IEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CTRLB3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_PER:4;
      uint64_t DST_PER:4;
      uint64_t reservedSpace0:1;
      uint64_t SRC_H2SEL:1;
      uint64_t reservedSpace1:3;
      uint64_t DST_H2SEL:1;
      uint64_t reservedSpace2:2;
      uint64_t SOD:1;
      uint64_t reservedSpace3:3;
      uint64_t LOCK_IF:1;
      uint64_t LOCK_B:1;
      uint64_t LOCK_IF_L:1;
      uint64_t reservedSpace4:1;
      uint64_t AHB_PROT:3;
      uint64_t reservedSpace5:1;
      uint64_t FIFOCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CFG3;

  uint8_t res5[280];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_WPSR;

