iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSEL0:1;
      uint64_t CSEL1:1;
      uint64_t CSEL2:1;
      uint64_t CSEL3:1;
      uint64_t CSEL4:1;
      uint64_t CSEL5:1;
      uint64_t CSEL6:1;
      uint64_t CSEL7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_ELMR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSEL0:1;
      uint64_t CSEL1:1;
      uint64_t CSEL2:1;
      uint64_t CSEL3:1;
      uint64_t CSEL4:1;
      uint64_t CSEL5:1;
      uint64_t CSEL6:1;
      uint64_t CSEL7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_ELMR_1;

  uint8_t res2[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCEN0:1;
      uint64_t GCEN1:1;
      uint64_t GCEN2:1;
      uint64_t GCEN3:1;
      uint64_t reservedSpace0:12;
      uint64_t DOWN0:1;
      uint64_t DOWN1:1;
      uint64_t DOWN2:1;
      uint64_t DOWN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_SMMR;

  uint8_t res3[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPCMD:2;
      uint64_t WPRG0:1;
      uint64_t WPRG1:1;
      uint64_t WPRG2:1;
      uint64_t WPRG3:1;
      uint64_t WPRG4:1;
      uint64_t WPRG5:1;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_WPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPSWS0:1;
      uint64_t WPSWS1:1;
      uint64_t WPSWS2:1;
      uint64_t WPSWS3:1;
      uint64_t WPSWS4:1;
      uint64_t WPSWS5:1;
      uint64_t reservedSpace0:1;
      uint64_t WPVS:1;
      uint64_t WPHWS0:1;
      uint64_t WPHWS1:1;
      uint64_t WPHWS2:1;
      uint64_t WPHWS3:1;
      uint64_t WPHWS4:1;
      uint64_t WPHWS5:1;
      uint64_t reservedSpace1:2;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_WPSR;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_TPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_TCR;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_TNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_TNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_PTSR;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:24;
      uint64_t CVM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPV0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVUPD:24;
      uint64_t CVMUPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPVUPD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CTR:4;
      uint64_t CPR:4;
      uint64_t CPRCNT:4;
      uint64_t CUPR:4;
      uint64_t CUPRCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENUPD:1;
      uint64_t reservedSpace0:3;
      uint64_t CTRUPD:4;
      uint64_t CPRUPD:4;
      uint64_t reservedSpace1:4;
      uint64_t CUPRUPD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPMUPD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:24;
      uint64_t CVM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPV1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVUPD:24;
      uint64_t CVMUPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPVUPD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CTR:4;
      uint64_t CPR:4;
      uint64_t CPRCNT:4;
      uint64_t CUPR:4;
      uint64_t CUPRCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENUPD:1;
      uint64_t reservedSpace0:3;
      uint64_t CTRUPD:4;
      uint64_t CPRUPD:4;
      uint64_t reservedSpace1:4;
      uint64_t CUPRUPD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPMUPD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:24;
      uint64_t CVM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPV2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVUPD:24;
      uint64_t CVMUPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPVUPD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CTR:4;
      uint64_t CPR:4;
      uint64_t CPRCNT:4;
      uint64_t CUPR:4;
      uint64_t CUPRCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENUPD:1;
      uint64_t reservedSpace0:3;
      uint64_t CTRUPD:4;
      uint64_t CPRUPD:4;
      uint64_t reservedSpace1:4;
      uint64_t CUPRUPD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPMUPD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:24;
      uint64_t CVM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPV3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVUPD:24;
      uint64_t CVMUPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPVUPD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CTR:4;
      uint64_t CPR:4;
      uint64_t CPRCNT:4;
      uint64_t CUPR:4;
      uint64_t CUPRCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENUPD:1;
      uint64_t reservedSpace0:3;
      uint64_t CTRUPD:4;
      uint64_t CPRUPD:4;
      uint64_t reservedSpace1:4;
      uint64_t CUPRUPD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPMUPD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:24;
      uint64_t CVM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPV4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVUPD:24;
      uint64_t CVMUPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPVUPD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CTR:4;
      uint64_t CPR:4;
      uint64_t CPRCNT:4;
      uint64_t CUPR:4;
      uint64_t CUPRCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENUPD:1;
      uint64_t reservedSpace0:3;
      uint64_t CTRUPD:4;
      uint64_t CPRUPD:4;
      uint64_t reservedSpace1:4;
      uint64_t CUPRUPD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPMUPD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:24;
      uint64_t CVM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPV5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVUPD:24;
      uint64_t CVMUPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPVUPD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CTR:4;
      uint64_t CPR:4;
      uint64_t CPRCNT:4;
      uint64_t CUPR:4;
      uint64_t CUPRCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPM5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENUPD:1;
      uint64_t reservedSpace0:3;
      uint64_t CTRUPD:4;
      uint64_t CPRUPD:4;
      uint64_t reservedSpace1:4;
      uint64_t CUPRUPD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPMUPD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:24;
      uint64_t CVM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPV6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVUPD:24;
      uint64_t CVMUPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPVUPD6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CTR:4;
      uint64_t CPR:4;
      uint64_t CPRCNT:4;
      uint64_t CUPR:4;
      uint64_t CUPRCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPM6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENUPD:1;
      uint64_t reservedSpace0:3;
      uint64_t CTRUPD:4;
      uint64_t CPRUPD:4;
      uint64_t reservedSpace1:4;
      uint64_t CUPRUPD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPMUPD6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CV:24;
      uint64_t CVM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPV7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVUPD:24;
      uint64_t CVMUPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPVUPD7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t reservedSpace0:3;
      uint64_t CTR:4;
      uint64_t CPR:4;
      uint64_t CPRCNT:4;
      uint64_t CUPR:4;
      uint64_t CUPRCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPM7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CENUPD:1;
      uint64_t reservedSpace0:3;
      uint64_t CTRUPD:4;
      uint64_t CPRUPD:4;
      uint64_t reservedSpace1:4;
      uint64_t CUPRUPD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMPMUPD7;

  uint8_t res7[80];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRE:4;
      uint64_t reservedSpace0:4;
      uint64_t CALG:1;
      uint64_t CPOL:1;
      uint64_t CES:1;
      uint64_t reservedSpace1:5;
      uint64_t DTE:1;
      uint64_t DTHI:1;
      uint64_t DTLI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTY0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTYUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTYUPD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRDUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRDUPD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CCNT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTH:16;
      uint64_t DTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTHUPD:16;
      uint64_t DTLUPD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DTUPD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRE:4;
      uint64_t reservedSpace0:4;
      uint64_t CALG:1;
      uint64_t CPOL:1;
      uint64_t CES:1;
      uint64_t reservedSpace1:5;
      uint64_t DTE:1;
      uint64_t DTHI:1;
      uint64_t DTLI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTY1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTYUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTYUPD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRDUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRDUPD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CCNT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTH:16;
      uint64_t DTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTHUPD:16;
      uint64_t DTLUPD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DTUPD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRE:4;
      uint64_t reservedSpace0:4;
      uint64_t CALG:1;
      uint64_t CPOL:1;
      uint64_t CES:1;
      uint64_t reservedSpace1:5;
      uint64_t DTE:1;
      uint64_t DTHI:1;
      uint64_t DTLI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTY2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTYUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTYUPD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRDUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRDUPD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CCNT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTH:16;
      uint64_t DTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTHUPD:16;
      uint64_t DTLUPD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DTUPD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRE:4;
      uint64_t reservedSpace0:4;
      uint64_t CALG:1;
      uint64_t CPOL:1;
      uint64_t CES:1;
      uint64_t reservedSpace1:5;
      uint64_t DTE:1;
      uint64_t DTHI:1;
      uint64_t DTLI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTY3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTYUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTYUPD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRDUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRDUPD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CCNT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTH:16;
      uint64_t DTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTHUPD:16;
      uint64_t DTLUPD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DTUPD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRE:4;
      uint64_t reservedSpace0:4;
      uint64_t CALG:1;
      uint64_t CPOL:1;
      uint64_t CES:1;
      uint64_t reservedSpace1:5;
      uint64_t DTE:1;
      uint64_t DTHI:1;
      uint64_t DTLI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTY4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTYUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTYUPD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRDUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRDUPD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CCNT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTH:16;
      uint64_t DTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTHUPD:16;
      uint64_t DTLUPD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DTUPD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRE:4;
      uint64_t reservedSpace0:4;
      uint64_t CALG:1;
      uint64_t CPOL:1;
      uint64_t CES:1;
      uint64_t reservedSpace1:5;
      uint64_t DTE:1;
      uint64_t DTHI:1;
      uint64_t DTLI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTY5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTYUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTYUPD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRDUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRDUPD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CCNT5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTH:16;
      uint64_t DTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DT5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTHUPD:16;
      uint64_t DTLUPD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DTUPD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRE:4;
      uint64_t reservedSpace0:4;
      uint64_t CALG:1;
      uint64_t CPOL:1;
      uint64_t CES:1;
      uint64_t reservedSpace1:5;
      uint64_t DTE:1;
      uint64_t DTHI:1;
      uint64_t DTLI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTY6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTYUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTYUPD6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRD6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRDUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRDUPD6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CCNT6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTH:16;
      uint64_t DTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DT6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTHUPD:16;
      uint64_t DTLUPD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DTUPD6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRE:4;
      uint64_t reservedSpace0:4;
      uint64_t CALG:1;
      uint64_t CPOL:1;
      uint64_t CES:1;
      uint64_t reservedSpace1:5;
      uint64_t DTE:1;
      uint64_t DTHI:1;
      uint64_t DTLI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CMR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTY7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDTYUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CDTYUPD7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRD7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPRDUPD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CPRDUPD7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CCNT7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTH:16;
      uint64_t DTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DT7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTHUPD:16;
      uint64_t DTLUPD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DTUPD7;

