iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
};

#define EVSYS_EVSYS_CHANNEL_5 (*(volatile struct EVSYS_EVSYS_CHANNEL_5_tag *) 0x42000048)

struct EVSYS_EVSYS_CHANNEL_6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVGEN:6;
      uint64_t reservedSpace0:2;
      uint64_t PATH:2;
      uint64_t EDGSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_CHANNEL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RDYUSR:1;
      uint64_t BUSYCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHSTATUS;

};

#define EVSYS_EVSYS_CHANNEL_6 (*(volatile struct EVSYS_EVSYS_CHANNEL_6_tag *) 0x42000050)

struct EVSYS_EVSYS_CHANNEL_7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVGEN:6;
      uint64_t reservedSpace0:2;
      uint64_t PATH:2;
      uint64_t EDGSEL:2;
      uint64_t reservedSpace1:2;
      uint64_t RUNSTDBY:1;
      uint64_t ONDEMAND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSYS_CHANNEL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVR:1;
      uint64_t EVD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHINTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RDYUSR:1;
      uint64_t BUSYCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EVSYS_CHSTATUS;

};

#define EVSYS_EVSYS_CHANNEL_7 (*(volatile struct EVSYS_EVSYS_CHANNEL_7_tag *) 0x42000058)

struct FREQM_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FREQM_CTRLA;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FREQM_CTRLB;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t REFNUM:8;
      uint64_t reservedSpace0:7;
      uint64_t DIVREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FREQM_CFGA;

  uint8_t res0[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FREQM_INTENCLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FREQM_INTENSET;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FREQM_INTFLAG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t OVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) FREQM_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FREQM_SYNCBUSY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FREQM_VALUE;

};

#define FREQM (*(volatile struct FREQM_tag *) 0x40002c00)

struct GCLK_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GCLK_CTRLA;

  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t reservedSpace0:1;
      uint64_t GENCTRL0:1;
      uint64_t GENCTRL1:1;
      uint64_t GENCTRL2:1;
      uint64_t GENCTRL3:1;
      uint64_t GENCTRL4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_SYNCBUSY;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC:3;
      uint64_t reservedSpace0:5;
      uint64_t GENEN:1;
      uint64_t IDC:1;
      uint64_t OOV:1;
      uint64_t OE:1;
      uint64_t DIVSEL:1;
      uint64_t RUNSTDBY:1;
      uint64_t reservedSpace1:2;
      uint64_t DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_GENCTRL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC:3;
      uint64_t reservedSpace0:5;
      uint64_t GENEN:1;
      uint64_t IDC:1;
      uint64_t OOV:1;
      uint64_t OE:1;
      uint64_t DIVSEL:1;
      uint64_t RUNSTDBY:1;
      uint64_t reservedSpace1:2;
      uint64_t DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_GENCTRL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC:3;
      uint64_t reservedSpace0:5;
      uint64_t GENEN:1;
      uint64_t IDC:1;
      uint64_t OOV:1;
      uint64_t OE:1;
      uint64_t DIVSEL:1;
      uint64_t RUNSTDBY:1;
      uint64_t reservedSpace1:2;
      uint64_t DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_GENCTRL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC:3;
      uint64_t reservedSpace0:5;
      uint64_t GENEN:1;
      uint64_t IDC:1;
      uint64_t OOV:1;
      uint64_t OE:1;
      uint64_t DIVSEL:1;
      uint64_t RUNSTDBY:1;
      uint64_t reservedSpace1:2;
      uint64_t DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_GENCTRL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC:3;
      uint64_t reservedSpace0:5;
      uint64_t GENEN:1;
      uint64_t IDC:1;
      uint64_t OOV:1;
      uint64_t OE:1;
      uint64_t DIVSEL:1;
      uint64_t RUNSTDBY:1;
      uint64_t reservedSpace1:2;
      uint64_t DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCLK_GENCTRL_4;

