iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:8;
      uint64_t reservedSpace0:8;
      uint64_t ADDRMASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_DATA;

  uint8_t res6[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DBGSTOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_DBGCTRL;

};

#define SERCOM1_SERCOM_SPI (*(volatile struct SERCOM1_SERCOM_SPI_tag *) 0x42000800)

struct SERCOM2_SERCOM_I2CM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t MODE:3;
      uint64_t reservedSpace0:2;
      uint64_t RUNSTDBY:1;
      uint64_t reservedSpace1:8;
      uint64_t PINOUT:1;
      uint64_t reservedSpace2:3;
      uint64_t SDAHOLD:2;
      uint64_t MEXTTOEN:1;
      uint64_t SEXTTOEN:1;
      uint64_t SPEED:2;
      uint64_t reservedSpace3:1;
      uint64_t SCLSM:1;
      uint64_t INACTOUT:2;
      uint64_t LOWTOUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_CTRLA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SMEN:1;
      uint64_t QCEN:1;
      uint64_t reservedSpace1:6;
      uint64_t CMD:2;
      uint64_t ACKACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_CTRLB;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BAUD:8;
      uint64_t BAUDLOW:8;
      uint64_t HSBAUD:8;
      uint64_t HSBAUDLOW:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_BAUD;

  uint8_t res1[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MB:1;
      uint64_t SB:1;
      uint64_t reservedSpace0:5;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_INTENCLR;

  uint8_t res2[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MB:1;
      uint64_t SB:1;
      uint64_t reservedSpace0:5;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_INTENSET;

  uint8_t res3[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MB:1;
      uint64_t SB:1;
      uint64_t reservedSpace0:5;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_INTFLAG;

  uint8_t res4[1];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUSERR:1;
      uint64_t ARBLOST:1;
      uint64_t RXNACK:1;
      uint64_t reservedSpace0:1;
      uint64_t BUSSTATE:2;
      uint64_t LOWTOUT:1;
      uint64_t CLKHOLD:1;
      uint64_t MEXTTOUT:1;
      uint64_t SEXTTOUT:1;
      uint64_t LENERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SERCOM_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t SYSOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_SYNCBUSY;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:11;
      uint64_t reservedSpace0:2;
      uint64_t LENEN:1;
      uint64_t HS:1;
      uint64_t TENBITEN:1;
      uint64_t LEN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_ADDR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_DATA;

  uint8_t res6[7];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DBGSTOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_DBGCTRL;

};

#define SERCOM2_SERCOM_I2CM (*(volatile struct SERCOM2_SERCOM_I2CM_tag *) 0x42000c00)

struct SERCOM2_SERCOM_I2CS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
      uint64_t MODE:3;
      uint64_t reservedSpace0:2;
      uint64_t RUNSTDBY:1;
      uint64_t reservedSpace1:8;
      uint64_t PINOUT:1;
      uint64_t reservedSpace2:3;
      uint64_t SDAHOLD:2;
      uint64_t reservedSpace3:1;
      uint64_t SEXTTOEN:1;
      uint64_t SPEED:2;
      uint64_t reservedSpace4:1;
      uint64_t SCLSM:1;
      uint64_t reservedSpace5:2;
      uint64_t LOWTOUTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_CTRLA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SMEN:1;
      uint64_t GCMD:1;
      uint64_t AACKEN:1;
      uint64_t reservedSpace1:3;
      uint64_t AMODE:2;
      uint64_t CMD:2;
      uint64_t ACKACT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_CTRLB;

  uint8_t res0[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PREC:1;
      uint64_t AMATCH:1;
      uint64_t DRDY:1;
      uint64_t reservedSpace0:4;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_INTENCLR;

  uint8_t res1[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PREC:1;
      uint64_t AMATCH:1;
      uint64_t DRDY:1;
      uint64_t reservedSpace0:4;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_INTENSET;

  uint8_t res2[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PREC:1;
      uint64_t AMATCH:1;
      uint64_t DRDY:1;
      uint64_t reservedSpace0:4;
      uint64_t ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SERCOM_INTFLAG;

  uint8_t res3[1];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUSERR:1;
      uint64_t COLL:1;
      uint64_t RXNACK:1;
      uint64_t DIR:1;
      uint64_t SR:1;
      uint64_t reservedSpace0:1;
      uint64_t LOWTOUT:1;
      uint64_t CLKHOLD:1;
      uint64_t reservedSpace1:1;
      uint64_t SEXTTOUT:1;
      uint64_t HS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SERCOM_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SERCOM_SYNCBUSY;

