iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
  uint8_t res0[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_HRB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_HRT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_SAB1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_SAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_SAB2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_SAT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_SAB3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_SAT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_SAB4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_SAT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TIDM_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TIDM_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TIDM_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TIDM_3;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_IPGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLAN_TYPE:16;
      uint64_t reservedSpace0:15;
      uint64_t ESVLAN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_SVLAN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEV:8;
      uint64_t PQ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TPFCP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_SAMB1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_SAMT1;

  uint8_t res2[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_OTLO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_OTHI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_FT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_BCFT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_MFT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFTX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_PFT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_BFT64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TBFT127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TBFT255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TBFT511;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TBFT1023;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TBFT1518;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFTX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_GTBFT1518;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXUNR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TUR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCOL:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_SCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCOL:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_MCF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XCOL:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_EC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LCOL:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_LC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEFT:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_DTF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_CSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_ORLO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXO:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_ORHI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_FR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_BCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_MFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFRX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_PFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_BFR64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TBFR127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TBFR255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TBFR511;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TBFR1023;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TBFR1518;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NFRX:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TMXBFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UFRX:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_UFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFRX:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_OFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JRX:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_JR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCKR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_FCSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFER:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_LFFE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSE:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_RSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AER:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_AE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRER:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_RRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXOVR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_ROE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HCKER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_IHCE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCKER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TCE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UCKER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_UCE;

  uint8_t res3[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VTS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TSSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VTN:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TSSN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TNS:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITDT:30;
      uint64_t reservedSpace0:1;
      uint64_t ADJ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNS:8;
      uint64_t ACNS:8;
      uint64_t NIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_TI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_EFTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_EFTN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_EFRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_EFRN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_PEFTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_PEFTN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_PEFRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUD:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GMAC_PEFRN;

