iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
};

#define SMC_1 (*(volatile struct SMC_1_tag *) 0x40060000)

struct UART1_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RSTRX:1;
      uint64_t RSTTX:1;
      uint64_t RXEN:1;
      uint64_t RXDIS:1;
      uint64_t TXEN:1;
      uint64_t TXDIS:1;
      uint64_t RSTSTA:1;
      uint64_t reservedSpace1:3;
      uint64_t REQCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t PAR:3;
      uint64_t reservedSpace1:2;
      uint64_t CHMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace2:1;
      uint64_t TXBUFE:1;
      uint64_t RXBUFF:1;
      uint64_t reservedSpace3:2;
      uint64_t CMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace2:1;
      uint64_t TXBUFE:1;
      uint64_t RXBUFF:1;
      uint64_t reservedSpace3:2;
      uint64_t CMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace2:1;
      uint64_t TXBUFE:1;
      uint64_t RXBUFF:1;
      uint64_t reservedSpace3:2;
      uint64_t CMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXRDY:1;
      uint64_t TXRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t ENDRX:1;
      uint64_t ENDTX:1;
      uint64_t OVRE:1;
      uint64_t FRAME:1;
      uint64_t PARE:1;
      uint64_t reservedSpace1:1;
      uint64_t TXEMPTY:1;
      uint64_t reservedSpace2:1;
      uint64_t TXBUFE:1;
      uint64_t RXBUFF:1;
      uint64_t reservedSpace3:2;
      uint64_t CMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCHR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_RHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCHR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_THR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_BRGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL1:8;
      uint64_t reservedSpace0:4;
      uint64_t CMPMODE:1;
      uint64_t reservedSpace1:1;
      uint64_t CMPPAR:1;
      uint64_t reservedSpace2:1;
      uint64_t VAL2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_CMPR;

  uint8_t res0[188];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_WPMR;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_RCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_TPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_RNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_RNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_TNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_TNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART1_PTSR;

};

#define UART1_1 (*(volatile struct UART1_1_tag *) 0x40060600)

struct HSMCI_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCIEN:1;
      uint64_t MCIDIS:1;
      uint64_t PWSEN:1;
      uint64_t PWSDIS:1;
      uint64_t reservedSpace0:3;
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKDIV:8;
      uint64_t PWSDIV:3;
      uint64_t RDPROOF:1;
      uint64_t WRPROOF:1;
      uint64_t FBYTE:1;
      uint64_t PADV:1;
      uint64_t PDCMODE:1;
      uint64_t CLKODD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTOCYC:4;
      uint64_t DTOMUL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_DTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDCSEL:2;
      uint64_t reservedSpace0:4;
      uint64_t SDCBUS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_SDCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_ARGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMDNB:6;
      uint64_t RSPTYP:2;
      uint64_t SPCMD:3;
      uint64_t OPDCMD:1;
      uint64_t MAXLAT:1;
      uint64_t reservedSpace0:3;
      uint64_t TRCMD:2;
      uint64_t TRDIR:1;
      uint64_t TRTYP:3;
      uint64_t reservedSpace1:2;
      uint64_t IOSPCMD:2;
      uint64_t ATACS:1;
      uint64_t BOOT_ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_CMDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BCNT:16;
      uint64_t BLKLEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_BLKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSTOCYC:4;
      uint64_t CSTOMUL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_CSTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_RSPR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_RSPR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_RSPR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_RSPR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_RDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HSMCI_TDR;

