iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_TNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_TNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DACC_PTSR;

};

#define DACC_1 (*(volatile struct DACC_1_tag *) 0x400b8000)

struct ACC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELMINUS:3;
      uint64_t reservedSpace0:1;
      uint64_t SELPLUS:3;
      uint64_t reservedSpace1:1;
      uint64_t ACEN:1;
      uint64_t EDGETYP:2;
      uint64_t reservedSpace2:1;
      uint64_t INV:1;
      uint64_t SELFS:1;
      uint64_t FE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC_MR;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CE:1;
      uint64_t SCO:1;
      uint64_t reservedSpace0:29;
      uint64_t MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC_ISR;

  uint8_t res1[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISEL:1;
      uint64_t HYST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC_ACR;

  uint8_t res2[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC_WPSR;

};

#define ACC_1 (*(volatile struct ACC_1_tag *) 0x400bc000)

struct DMAC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t ARB_CFG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_GCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSREQ0:1;
      uint64_t DSREQ0:1;
      uint64_t SSREQ1:1;
      uint64_t DSREQ1:1;
      uint64_t SSREQ2:1;
      uint64_t DSREQ2:1;
      uint64_t SSREQ3:1;
      uint64_t DSREQ3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_SREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCREQ0:1;
      uint64_t DCREQ0:1;
      uint64_t SCREQ1:1;
      uint64_t DCREQ1:1;
      uint64_t SCREQ2:1;
      uint64_t DCREQ2:1;
      uint64_t SCREQ3:1;
      uint64_t DCREQ3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLAST0:1;
      uint64_t DLAST0:1;
      uint64_t SLAST1:1;
      uint64_t DLAST1:1;
      uint64_t SLAST2:1;
      uint64_t DLAST2:1;
      uint64_t SLAST3:1;
      uint64_t DLAST3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_LAST;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t reservedSpace0:4;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t reservedSpace1:4;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_EBCIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t reservedSpace0:4;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t reservedSpace1:4;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_EBCIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t reservedSpace0:4;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t reservedSpace1:4;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_EBCIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTC0:1;
      uint64_t BTC1:1;
      uint64_t BTC2:1;
      uint64_t BTC3:1;
      uint64_t reservedSpace0:4;
      uint64_t CBTC0:1;
      uint64_t CBTC1:1;
      uint64_t CBTC2:1;
      uint64_t CBTC3:1;
      uint64_t reservedSpace1:4;
      uint64_t ERR0:1;
      uint64_t ERR1:1;
      uint64_t ERR2:1;
      uint64_t ERR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_EBCISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA0:1;
      uint64_t ENA1:1;
      uint64_t ENA2:1;
      uint64_t ENA3:1;
      uint64_t reservedSpace0:4;
      uint64_t SUSP0:1;
      uint64_t SUSP1:1;
      uint64_t SUSP2:1;
      uint64_t SUSP3:1;
      uint64_t reservedSpace1:12;
      uint64_t KEEP0:1;
      uint64_t KEEP1:1;
      uint64_t KEEP2:1;
      uint64_t KEEP3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CHER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIS0:1;
      uint64_t DIS1:1;
      uint64_t DIS2:1;
      uint64_t DIS3:1;
      uint64_t reservedSpace0:4;
      uint64_t RES0:1;
      uint64_t RES1:1;
      uint64_t RES2:1;
      uint64_t RES3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CHDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENA0:1;
      uint64_t ENA1:1;
      uint64_t ENA2:1;
      uint64_t ENA3:1;
      uint64_t reservedSpace0:4;
      uint64_t SUSP0:1;
      uint64_t SUSP1:1;
      uint64_t SUSP2:1;
      uint64_t SUSP3:1;
      uint64_t reservedSpace1:4;
      uint64_t EMPT0:1;
      uint64_t EMPT1:1;
      uint64_t EMPT2:1;
      uint64_t EMPT3:1;
      uint64_t reservedSpace2:4;
      uint64_t STAL0:1;
      uint64_t STAL1:1;
      uint64_t STAL2:1;
      uint64_t STAL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CHSR;

