iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
};

#define DMAC_2 (*(volatile struct DMAC_2_tag *) 0x400c0000)

struct CMCC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AP:1;
      uint64_t GCLK_bitfield:1;
      uint64_t RANDP:1;
      uint64_t LRUP:1;
      uint64_t RRP:1;
      uint64_t WAYNUM:2;
      uint64_t LCKDOWN:1;
      uint64_t CSIZE:3;
      uint64_t CLSIZE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMCC_TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCLKDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMCC_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMCC_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMCC_SR;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMCC_MAINT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t INDEX:5;
      uint64_t reservedSpace1:21;
      uint64_t WAY:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMCC_MAINT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMCC_MCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMCC_MEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMCC_MCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVENT_CNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMCC_MSR;

};

#define CMCC_1 (*(volatile struct CMCC_1_tag *) 0x400c4000)

struct MATRIX_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_6;

  uint8_t res0[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:9;
      uint64_t reservedSpace0:7;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:9;
      uint64_t reservedSpace0:7;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:9;
      uint64_t reservedSpace0:7;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:9;
      uint64_t reservedSpace0:7;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:9;
      uint64_t reservedSpace0:7;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:9;
      uint64_t reservedSpace0:7;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_5;

  uint8_t res1[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0PR:2;
      uint64_t reservedSpace0:2;
      uint64_t M1PR:2;
      uint64_t reservedSpace1:2;
      uint64_t M2PR:2;
      uint64_t reservedSpace2:2;
      uint64_t M3PR:2;
      uint64_t reservedSpace3:2;
      uint64_t M4PR:2;
      uint64_t reservedSpace4:2;
      uint64_t M5PR:2;
      uint64_t reservedSpace5:2;
      uint64_t M6PR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_PRAS0;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0PR:2;
      uint64_t reservedSpace0:2;
      uint64_t M1PR:2;
      uint64_t reservedSpace1:2;
      uint64_t M2PR:2;
      uint64_t reservedSpace2:2;
      uint64_t M3PR:2;
      uint64_t reservedSpace3:2;
      uint64_t M4PR:2;
      uint64_t reservedSpace4:2;
      uint64_t M5PR:2;
      uint64_t reservedSpace5:2;
      uint64_t M6PR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_PRAS1;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0PR:2;
      uint64_t reservedSpace0:2;
      uint64_t M1PR:2;
      uint64_t reservedSpace1:2;
      uint64_t M2PR:2;
      uint64_t reservedSpace2:2;
      uint64_t M3PR:2;
      uint64_t reservedSpace3:2;
      uint64_t M4PR:2;
      uint64_t reservedSpace4:2;
      uint64_t M5PR:2;
      uint64_t reservedSpace5:2;
      uint64_t M6PR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_PRAS2;

