iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
struct SSC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXEN:1;
      uint64_t RXDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXEN:1;
      uint64_t TXDIS:1;
      uint64_t reservedSpace1:5;
      uint64_t SWRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_CMR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKS:2;
      uint64_t CKO:3;
      uint64_t CKI:1;
      uint64_t CKG:2;
      uint64_t START:4;
      uint64_t STOP:1;
      uint64_t reservedSpace0:3;
      uint64_t STTDLY:8;
      uint64_t PERIOD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RCMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATLEN:5;
      uint64_t LOOP:1;
      uint64_t reservedSpace0:1;
      uint64_t MSBF:1;
      uint64_t DATNB:4;
      uint64_t reservedSpace1:4;
      uint64_t FSLEN:4;
      uint64_t FSOS:3;
      uint64_t reservedSpace2:1;
      uint64_t FSEDGE:1;
      uint64_t reservedSpace3:3;
      uint64_t FSLEN_EXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RFMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CKS:2;
      uint64_t CKO:3;
      uint64_t CKI:1;
      uint64_t CKG:2;
      uint64_t START:4;
      uint64_t reservedSpace0:4;
      uint64_t STTDLY:8;
      uint64_t PERIOD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_TCMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATLEN:5;
      uint64_t DATDEF:1;
      uint64_t reservedSpace0:1;
      uint64_t MSBF:1;
      uint64_t DATNB:4;
      uint64_t reservedSpace1:4;
      uint64_t FSLEN:4;
      uint64_t FSOS:3;
      uint64_t FSDEN:1;
      uint64_t FSEDGE:1;
      uint64_t reservedSpace2:3;
      uint64_t FSLEN_EXT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_TFMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_THR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSDAT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RSHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSDAT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_TSHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RC0R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RC1R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t TXEMPTY:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
      uint64_t RXRDY:1;
      uint64_t OVRUN:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
      uint64_t CP0:1;
      uint64_t CP1:1;
      uint64_t TXSYN:1;
      uint64_t RXSYN:1;
      uint64_t reservedSpace0:4;
      uint64_t TXEN:1;
      uint64_t RXEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t TXEMPTY:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
      uint64_t RXRDY:1;
      uint64_t OVRUN:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
      uint64_t CP0:1;
      uint64_t CP1:1;
      uint64_t TXSYN:1;
      uint64_t RXSYN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t TXEMPTY:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
      uint64_t RXRDY:1;
      uint64_t OVRUN:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
      uint64_t CP0:1;
      uint64_t CP1:1;
      uint64_t TXSYN:1;
      uint64_t RXSYN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXRDY:1;
      uint64_t TXEMPTY:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
      uint64_t RXRDY:1;
      uint64_t OVRUN:1;
      uint64_t ENDRX:1;
      uint64_t RXBUFF:1;
      uint64_t CP0:1;
      uint64_t CP1:1;
      uint64_t TXSYN:1;
      uint64_t RXSYN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_IMR;

  uint8_t res2[148];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_WPMR;

  uint32_t SSC_WPSR;
  uint8_t res3[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_TPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_RNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_TNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_TNCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSC_PTSR;

