iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
};

#define SSC_2 (*(volatile struct SSC_2_tag *) 0x40004000)

struct PWM_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVA:8;
      uint64_t PREA:4;
      uint64_t reservedSpace0:4;
      uint64_t DIVB:8;
      uint64_t PREB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_CLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHID0:1;
      uint64_t CHID1:1;
      uint64_t CHID2:1;
      uint64_t CHID3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_ENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHID0:1;
      uint64_t CHID1:1;
      uint64_t CHID2:1;
      uint64_t CHID3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_DIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHID0:1;
      uint64_t CHID1:1;
      uint64_t CHID2:1;
      uint64_t CHID3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHID0:1;
      uint64_t CHID1:1;
      uint64_t CHID2:1;
      uint64_t CHID3:1;
      uint64_t reservedSpace0:12;
      uint64_t FCHID0:1;
      uint64_t FCHID1:1;
      uint64_t FCHID2:1;
      uint64_t FCHID3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_IER1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHID0:1;
      uint64_t CHID1:1;
      uint64_t CHID2:1;
      uint64_t CHID3:1;
      uint64_t reservedSpace0:12;
      uint64_t FCHID0:1;
      uint64_t FCHID1:1;
      uint64_t FCHID2:1;
      uint64_t FCHID3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_IDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHID0:1;
      uint64_t CHID1:1;
      uint64_t CHID2:1;
      uint64_t CHID3:1;
      uint64_t reservedSpace0:12;
      uint64_t FCHID0:1;
      uint64_t FCHID1:1;
      uint64_t FCHID2:1;
      uint64_t FCHID3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_IMR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHID0:1;
      uint64_t CHID1:1;
      uint64_t CHID2:1;
      uint64_t CHID3:1;
      uint64_t reservedSpace0:12;
      uint64_t FCHID0:1;
      uint64_t FCHID1:1;
      uint64_t FCHID2:1;
      uint64_t FCHID3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_ISR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNC0:1;
      uint64_t SYNC1:1;
      uint64_t SYNC2:1;
      uint64_t SYNC3:1;
      uint64_t reservedSpace0:12;
      uint64_t UPDM:2;
      uint64_t reservedSpace1:2;
      uint64_t PTRM:1;
      uint64_t PTRCS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_SCM;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPDULOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_SCUC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPR:4;
      uint64_t UPRCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_SCUP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPRUPD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_SCUPUPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRDY:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
      uint64_t UNRE:1;
      uint64_t reservedSpace0:4;
      uint64_t CMPM0:1;
      uint64_t CMPM1:1;
      uint64_t CMPM2:1;
      uint64_t CMPM3:1;
      uint64_t CMPM4:1;
      uint64_t CMPM5:1;
      uint64_t CMPM6:1;
      uint64_t CMPM7:1;
      uint64_t CMPU0:1;
      uint64_t CMPU1:1;
      uint64_t CMPU2:1;
      uint64_t CMPU3:1;
      uint64_t CMPU4:1;
      uint64_t CMPU5:1;
      uint64_t CMPU6:1;
      uint64_t CMPU7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_IER2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRDY:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
      uint64_t UNRE:1;
      uint64_t reservedSpace0:4;
      uint64_t CMPM0:1;
      uint64_t CMPM1:1;
      uint64_t CMPM2:1;
      uint64_t CMPM3:1;
      uint64_t CMPM4:1;
      uint64_t CMPM5:1;
      uint64_t CMPM6:1;
      uint64_t CMPM7:1;
      uint64_t CMPU0:1;
      uint64_t CMPU1:1;
      uint64_t CMPU2:1;
      uint64_t CMPU3:1;
      uint64_t CMPU4:1;
      uint64_t CMPU5:1;
      uint64_t CMPU6:1;
      uint64_t CMPU7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_IDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRDY:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
      uint64_t UNRE:1;
      uint64_t reservedSpace0:4;
      uint64_t CMPM0:1;
      uint64_t CMPM1:1;
      uint64_t CMPM2:1;
      uint64_t CMPM3:1;
      uint64_t CMPM4:1;
      uint64_t CMPM5:1;
      uint64_t CMPM6:1;
      uint64_t CMPM7:1;
      uint64_t CMPU0:1;
      uint64_t CMPU1:1;
      uint64_t CMPU2:1;
      uint64_t CMPU3:1;
      uint64_t CMPU4:1;
      uint64_t CMPU5:1;
      uint64_t CMPU6:1;
      uint64_t CMPU7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_IMR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRDY:1;
      uint64_t ENDTX:1;
      uint64_t TXBUFE:1;
      uint64_t UNRE:1;
      uint64_t reservedSpace0:4;
      uint64_t CMPM0:1;
      uint64_t CMPM1:1;
      uint64_t CMPM2:1;
      uint64_t CMPM3:1;
      uint64_t CMPM4:1;
      uint64_t CMPM5:1;
      uint64_t CMPM6:1;
      uint64_t CMPM7:1;
      uint64_t CMPU0:1;
      uint64_t CMPU1:1;
      uint64_t CMPU2:1;
      uint64_t CMPU3:1;
      uint64_t CMPU4:1;
      uint64_t CMPU5:1;
      uint64_t CMPU6:1;
      uint64_t CMPU7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_ISR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OOVH0:1;
      uint64_t OOVH1:1;
      uint64_t OOVH2:1;
      uint64_t OOVH3:1;
      uint64_t reservedSpace0:12;
      uint64_t OOVL0:1;
      uint64_t OOVL1:1;
      uint64_t OOVL2:1;
      uint64_t OOVL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_OOV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSH0:1;
      uint64_t OSH1:1;
      uint64_t OSH2:1;
      uint64_t OSH3:1;
      uint64_t reservedSpace0:12;
      uint64_t OSL0:1;
      uint64_t OSL1:1;
      uint64_t OSL2:1;
      uint64_t OSL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_OS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSSH0:1;
      uint64_t OSSH1:1;
      uint64_t OSSH2:1;
      uint64_t OSSH3:1;
      uint64_t reservedSpace0:12;
      uint64_t OSSL0:1;
      uint64_t OSSL1:1;
      uint64_t OSSL2:1;
      uint64_t OSSL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_OSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSCH0:1;
      uint64_t OSCH1:1;
      uint64_t OSCH2:1;
      uint64_t OSCH3:1;
      uint64_t reservedSpace0:12;
      uint64_t OSCL0:1;
      uint64_t OSCL1:1;
      uint64_t OSCL2:1;
      uint64_t OSCL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_OSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSSUPH0:1;
      uint64_t OSSUPH1:1;
      uint64_t OSSUPH2:1;
      uint64_t OSSUPH3:1;
      uint64_t reservedSpace0:12;
      uint64_t OSSUPL0:1;
      uint64_t OSSUPL1:1;
      uint64_t OSSUPL2:1;
      uint64_t OSSUPL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_OSSUPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSCUPH0:1;
      uint64_t OSCUPH1:1;
      uint64_t OSCUPH2:1;
      uint64_t OSCUPH3:1;
      uint64_t reservedSpace0:12;
      uint64_t OSCUPL0:1;
      uint64_t OSCUPL1:1;
      uint64_t OSCUPL2:1;
      uint64_t OSCUPL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_OSCUPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPOL:8;
      uint64_t FMOD:8;
      uint64_t FFIL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_FMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIV:8;
      uint64_t FS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_FSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCLR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPVH0:1;
      uint64_t FPVH1:1;
      uint64_t FPVH2:1;
      uint64_t FPVH3:1;
      uint64_t reservedSpace0:12;
      uint64_t FPVL0:1;
      uint64_t FPVL1:1;
      uint64_t FPVL2:1;
      uint64_t FPVL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_FPV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPE0:8;
      uint64_t FPE1:8;
      uint64_t FPE2:8;
      uint64_t FPE3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_FPE;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSEL0:1;
      uint64_t CSEL1:1;
      uint64_t CSEL2:1;
      uint64_t CSEL3:1;
      uint64_t CSEL4:1;
      uint64_t CSEL5:1;
      uint64_t CSEL6:1;
      uint64_t CSEL7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_ELMR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSEL0:1;
      uint64_t CSEL1:1;
      uint64_t CSEL2:1;
      uint64_t CSEL3:1;
      uint64_t CSEL4:1;
      uint64_t CSEL5:1;
      uint64_t CSEL6:1;
      uint64_t CSEL7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWM_ELMR_1;

