iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t TSON:1;
      uint64_t reservedSpace1:3;
      uint64_t IBCTL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_ACR;

  uint8_t res3[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_WPSR;

  uint8_t res4[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_RPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_RCR;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_RNPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXNCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_RNCR;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t RXTDIS:1;
      uint64_t reservedSpace0:6;
      uint64_t TXTEN:1;
      uint64_t TXTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_PTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXTEN:1;
      uint64_t reservedSpace0:7;
      uint64_t TXTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC_PTSR;

};

#define ADC_2 (*(volatile struct ADC_2_tag *) 0x40038000)

struct CRCCU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t DSCR:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_DSCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_DMA_EN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMADIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_DMA_DIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMASR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_DMA_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAIER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_DMA_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAIDR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_DMA_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAIMR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_DMA_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAISR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_DMA_ISR;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t COMPARE:1;
      uint64_t PTYPE:2;
      uint64_t DIVIDER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_MR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRIER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_IER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRIDR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_IDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRIMR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRISR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCCU_ISR;

};

#define CRCCU (*(volatile struct CRCCU_tag *) 0x40044000)

struct MATRIX_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULBT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_MCFG_3;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLOT_CYCLE:8;
      uint64_t reservedSpace0:8;
      uint64_t DEFMSTR_TYPE:2;
      uint64_t FIXED_DEFMSTR:3;
      uint64_t reservedSpace1:3;
      uint64_t ARBT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_SCFG_4;

  uint8_t res1[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0PR:2;
      uint64_t reservedSpace0:2;
      uint64_t M1PR:2;
      uint64_t reservedSpace1:2;
      uint64_t M2PR:2;
      uint64_t reservedSpace2:2;
      uint64_t M3PR:2;
      uint64_t reservedSpace3:2;
      uint64_t M4PR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_PRAS0;

