iSYSTEMLabs/winIDEAExampleWorkspaces/Atmel/SAM3S4C/emptyTargetInit/SAM3S4C_sfr.h
  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0PR:2;
      uint64_t reservedSpace0:2;
      uint64_t M1PR:2;
      uint64_t reservedSpace1:2;
      uint64_t M2PR:2;
      uint64_t reservedSpace2:2;
      uint64_t M3PR:2;
      uint64_t reservedSpace3:2;
      uint64_t M4PR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_PRAS1;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0PR:2;
      uint64_t reservedSpace0:2;
      uint64_t M1PR:2;
      uint64_t reservedSpace1:2;
      uint64_t M2PR:2;
      uint64_t reservedSpace2:2;
      uint64_t M3PR:2;
      uint64_t reservedSpace3:2;
      uint64_t M4PR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_PRAS2;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0PR:2;
      uint64_t reservedSpace0:2;
      uint64_t M1PR:2;
      uint64_t reservedSpace1:2;
      uint64_t M2PR:2;
      uint64_t reservedSpace2:2;
      uint64_t M3PR:2;
      uint64_t reservedSpace3:2;
      uint64_t M4PR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_PRAS3;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0PR:2;
      uint64_t reservedSpace0:2;
      uint64_t M1PR:2;
      uint64_t reservedSpace1:2;
      uint64_t M2PR:2;
      uint64_t reservedSpace2:2;
      uint64_t M3PR:2;
      uint64_t reservedSpace3:2;
      uint64_t M4PR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_PRAS4;

  uint8_t res6[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SYSIO4:1;
      uint64_t SYSIO5:1;
      uint64_t SYSIO6:1;
      uint64_t SYSIO7:1;
      uint64_t reservedSpace1:2;
      uint64_t SYSIO10:1;
      uint64_t SYSIO11:1;
      uint64_t SYSIO12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCFG_SYSIO;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMC_NFCS0:1;
      uint64_t SMC_NFCS1:1;
      uint64_t SMC_NFCS2:1;
      uint64_t SMC_NFCS3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCFG_SMCNFCS;

  uint8_t res8[196];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPEN:1;
      uint64_t reservedSpace0:7;
      uint64_t WPKEY:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_WPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WPVS:1;
      uint64_t reservedSpace0:7;
      uint64_t WPVSRC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATRIX_WPSR;

};

#define MATRIX_2 (*(volatile struct MATRIX_2_tag *) 0x400e0200)

struct PMC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t UDP:1;
      uint64_t PCK0:1;
      uint64_t PCK1:1;
      uint64_t PCK2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_SCER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t UDP:1;
      uint64_t PCK0:1;
      uint64_t PCK1:1;
      uint64_t PCK2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_SCDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t UDP:1;
      uint64_t PCK0:1;
      uint64_t PCK1:1;
      uint64_t PCK2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_SCSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PID8:1;
      uint64_t PID9:1;
      uint64_t PID10:1;
      uint64_t PID11:1;
      uint64_t PID12:1;
      uint64_t PID13:1;
      uint64_t PID14:1;
      uint64_t PID15:1;
      uint64_t reservedSpace1:2;
      uint64_t PID18:1;
      uint64_t PID19:1;
      uint64_t PID20:1;
      uint64_t PID21:1;
      uint64_t PID22:1;
      uint64_t PID23:1;
      uint64_t PID24:1;
      uint64_t PID25:1;
      uint64_t PID26:1;
      uint64_t PID27:1;
      uint64_t PID28:1;
      uint64_t PID29:1;
      uint64_t PID30:1;
      uint64_t PID31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PCER0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PID8:1;
      uint64_t PID9:1;
      uint64_t PID10:1;
      uint64_t PID11:1;
      uint64_t PID12:1;
      uint64_t PID13:1;
      uint64_t PID14:1;
      uint64_t PID15:1;
      uint64_t reservedSpace1:2;
      uint64_t PID18:1;
      uint64_t PID19:1;
      uint64_t PID20:1;
      uint64_t PID21:1;
      uint64_t PID22:1;
      uint64_t PID23:1;
      uint64_t PID24:1;
      uint64_t PID25:1;
      uint64_t PID26:1;
      uint64_t PID27:1;
      uint64_t PID28:1;
      uint64_t PID29:1;
      uint64_t PID30:1;
      uint64_t PID31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PCDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t PID8:1;
      uint64_t PID9:1;
      uint64_t PID10:1;
      uint64_t PID11:1;
      uint64_t PID12:1;
      uint64_t PID13:1;
      uint64_t PID14:1;
      uint64_t PID15:1;
      uint64_t reservedSpace1:2;
      uint64_t PID18:1;
      uint64_t PID19:1;
      uint64_t PID20:1;
      uint64_t PID21:1;
      uint64_t PID22:1;
      uint64_t PID23:1;
      uint64_t PID24:1;
      uint64_t PID25:1;
      uint64_t PID26:1;
      uint64_t PID27:1;
      uint64_t PID28:1;
      uint64_t PID29:1;
      uint64_t PID30:1;
      uint64_t PID31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_PCSR0;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCXTEN:1;
      uint64_t MOSCXTBY:1;
      uint64_t reservedSpace0:1;
      uint64_t MOSCRCEN:1;
      uint64_t MOSCRCF:3;
      uint64_t reservedSpace1:1;
      uint64_t MOSCXTST:8;
      uint64_t KEY:8;
      uint64_t MOSCSEL:1;
      uint64_t CFDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKGR_MOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAINF:16;
      uint64_t MAINFRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKGR_MCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVA:8;
      uint64_t PLLACOUNT:6;
      uint64_t reservedSpace0:2;
      uint64_t MULA:11;
      uint64_t reservedSpace1:2;
      uint64_t ONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKGR_PLLAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVB:8;
      uint64_t PLLBCOUNT:6;
      uint64_t reservedSpace0:2;
      uint64_t MULB:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKGR_PLLBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSS:2;
      uint64_t reservedSpace0:2;
      uint64_t PRES:3;
      uint64_t reservedSpace1:5;
      uint64_t PLLADIV2:1;
      uint64_t PLLBDIV2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMC_MCKR;

